vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
/*
 * OTG (STM32F4xx) USB host controller emulation
 *
 * Original Copyright (c) 2020 Paul Zimmerman <pauldzim@gmail.com>
 * Based on hw/usb/hcd-dwc2.c as shipped with QEMU
 * Adapted for Mini404/STM32F4xx 2021-3 by VintagePC <http://github.com/vintagepc>
 *
 * Some useful documentation used to develop this emulation can be
 * found online (as of April 2020) at:
 *
 * http://www.capital-micro.com/PDF/CME-M7_Family_User_Guide_EN.pdf
 * which has a pretty complete description of the controller starting
 * on page 370.
 *
 * https://sourceforge.net/p/wive-ng/wive-ng-mt/ci/master/tree/docs/DataSheets/RT3050_5x_V2.0_081408_0902.pdf
 * which has a description of the controller registers starting on
 * page 130.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the
 * GNU General Public License for more details.
 */

#include "qemu/osdep.h"
#include "qemu/units.h"
#include "qapi/error.h"
#include "stm32f4xx_usb.h"
#include "hw/usb/dwc2-regs.h"
#include "../utility/usbip_server.h"
#include "../utility/usbip.h"

#undef DCTL
#undef DCFG
#undef DAINT
#undef DSTS
#undef DAINTMSK
#undef GINTSTS
#undef DOEPMSK
#undef DIEPMSK

#include "migration/vmstate.h"
#include "trace.h"
#include "system/dma.h"
#include "hw/core/irq.h"
#include "hw/usb/usb.h"
#include "system/address-spaces.h"
#include "chardev/char-fe.h"
#include "chardev/char.h"
#include "qemu/log.h"
#include "hw/core/qdev-properties.h"
#include "hw/core/qdev-properties-system.h"
#include "../stm32_common/stm32_common.h"
#include "../utility/macros.h"

#define USB_HZ_FS       12000000
#define USB_HZ_HS       96000000 // was 96, this might be wrong but STM clocks usb at 48 mhz
#define USB_FRMINTVL    12000

#define USBIP_ENABLED 0

// Register indexes.
enum REGDEF {
	RI_HREG_BEGIN = 0x500/4,
	RI_HCCHAR =    	RI_HREG_BEGIN,
	RI_HCSPLT =    	0x504/4,
	RI_HCINT =     	0x508/4,
	RI_HCINTMSK =  	0x50C/4,
	RI_HCTSIZ =    	0x510/4,
	RI_HCDMA =     	0x514/4,
	RI_HREG_END = 	0x51C/4,
	REGENUM_SIZE(HREG),
	REGENUM_OFFSET(HCCHAR, RI_HREG_BEGIN),
	REGENUM_OFFSET(HCSPLT, RI_HREG_BEGIN),
	REGENUM_OFFSET(HCINT, RI_HREG_BEGIN),
	REGENUM_OFFSET(HCINTMSK, RI_HREG_BEGIN),
	REGENUM_OFFSET(HCTSIZ, RI_HREG_BEGIN),
	REGENUM_OFFSET(HCDMA, RI_HREG_BEGIN),
	RI_DCFG = 	 	0x800U/4U,
	RI_DCTL, 	 	//0x804
	RI_DSTS, 	 	//0x808
	RI_DIEPMSK = 	0x810U/4U,
	RI_DOEPMSK, 	//0x814
	RI_DAINT, 		//0x818
	RI_DATINTMSK, 	//0x81C

	RI_DIEP_BEGIN = 0x900/4U,
	RI_DIEPCTL = 	RI_DIEP_BEGIN,
	RI_DIEPINT = 	0x908/4U,
	RI_DIEPTSIZ = 	0x910/4U,
	RI_DTXFSTS = 	0x918/4U,
	RI_DIEP_END = 	0x91C/4U,
	REGENUM_SIZE(DIEP),
	REGENUM_OFFSET(DIEPCTL, RI_DIEP_BEGIN),
	REGENUM_OFFSET(DIEPINT, RI_DIEP_BEGIN),
	REGENUM_OFFSET(DIEPTSIZ, RI_DIEP_BEGIN),
	REGENUM_OFFSET(DTXFSTS, RI_DIEP_BEGIN),
	RI_DOEP_BEGIN = 0xB00/4U,
	RI_DOEPCTL =	RI_DOEP_BEGIN,
	RI_DOEPINT = 	0xB08/4U,
	RI_DOEPTSIZ = 	0xB10/4U,
	RI_DOEP_END = 	0xB1C/4U,
	REGENUM_SIZE(DOEP),
	REGENUM_OFFSET(DOEPCTL, RI_DOEP_BEGIN),
	REGENUM_OFFSET(DOEPINT, RI_DOEP_BEGIN),
	REGENUM_OFFSET(DOEPTSIZ, RI_DOEP_BEGIN),
};

#define R_GINTSTS  (0x014/4)

#define R_DCFG          (0x800/4)
#define R_DCTL          (0x804/4)
#define R_DIEPMSK       (0x810/4)
#define R_DOEPMSK       (0x814/4)
#define R_DAINT         (0x818/4)
#define R_DAINTMSK      (0x81C/4)
#define R_DIEPEMPMSK    (0x834/4)

#define R_PCGCTL (0xE00/4)
#define R_PCGCCTL1 (0xE04/4)

#define STM32F4xx_NB_CHAN        16       /* Number of host channels */
// N.B - device has max 12, but the LL HAL code resets up to 16 (likely for other device compat)
#define STM32F4xx_NB_DEVCHAN        4       /* Number of device-mode channels */
#define STM32F4xx_MAX_XFER_SIZE  64*KiB   /* Max transfer size expected in HCTSIZ */

#define STM32F4xx_EP_FIFO_SIZE 4*KiB / sizeof(uint32_t)
#define STM32F4xx_RX_FIFO_SIZE (128*KiB)/sizeof(uint32_t)

typedef struct STM32F4xxPacket STM32F4xxPacket;
typedef struct STM32F4xxUSBState STM32F4xxUSBState;
typedef struct STM32F4xxClass STM32F4xxClass;

enum async_state {
    STM32F4xx_ASYNC_NONE = 0,
    STM32F4xx_ASYNC_INITIALIZED,
    STM32F4xx_ASYNC_INFLIGHT,
    STM32F4xx_ASYNC_FINISHED,
};

struct STM32F4xxPacket {
    USBPacket packet;
    uint32_t devadr;
    uint32_t epnum;
    uint32_t epdir;
    uint32_t mps;
    uint32_t pid;
    uint32_t index;
    uint32_t pcnt;
    uint32_t len;
    int32_t async;
    bool small;
    bool needs_service;
};

REGDEF_BLOCK_BEGIN()
	REG_K32(CHNUM, 4);
	REG_K32(BCNT, 11);
	REG_K32(DPID, 2);
	REG_K32(PKTSTS, 4);
	REG_R(11);
REGDEF_BLOCK_END(usb, rxstatus);

REGDEF_BLOCK_BEGIN()
    REG_K32(MPSIZ,11);
    REG_R(4);
    REG_B32(USBAEP);
    REG_B32(EONUMDPID);
    REG_B32(NAKSTS);
    REG_K32(EPTYP,2);
    REG_B32(DO_SNPM);
    REG_B32(STALL);
    REG_K32(DI_TXFNUM,4);
    REG_B32(CNAK);
    REG_B32(SNAK);
    REG_B32(SD0PID);
    REG_B32(SODDFRM);
    REG_B32(EPDIS);
    REG_B32(EPENA);
REGDEF_BLOCK_END(usb, depctl);

REGDEF_BLOCK_BEGIN()
    REG_B32(XFRC);
    REG_B32(EPDISD);
    REG_RB();
    REG_B32(TOC);
    REG_B32(ITTXFE);
    REG_B32(INEPNM);
    REG_B32(INEPNE);
    REG_B32(TXFE);
    REG_R(3);
    REG_B32(PKTDRPSTS);
    REG_RB();
    REG_B32(NAK);
    REG_R(18);
REGDEF_BLOCK_END(usb, diepint);

REGDEF_BLOCK_BEGIN()
    REG_B32(XFRC);
    REG_B32(EPDISD);
    REG_RB();
    REG_B32(STUP);
    REG_B32(OTEPDIS);
    REG_B32(STSPHSRX);
    REG_R(2);
    REG_B32(OUTPKTERR);
    REG_R(3);
    REG_B32(BERR);
    REG_B32(NAK);
    REG_R(18);
REGDEF_BLOCK_END(usb, doepint);

REGDEF_BLOCK_BEGIN()
    REG_K32(XFRSIZ, 19);
    REG_K32(PKTCNT, 10);
    REG_K32(DO_RXPID_STUPCNT, 2);
    REG_RB();
REGDEF_BLOCK_END(usb, deptsiz);

REGDEF_BLOCK_BEGIN()
        REGDEF_NAME(usb, depctl) DIEPCTL; // 0x900
        REGDEF_R(0x904);
        REGDEF_NAME(usb, diepint) DIEPINT; // 0x908
        REGDEF_R(0x90C);
        REGDEF_NAME(usb, deptsiz) DIEPTSIZ; // 0x910
        REGDEF_R(0x914);
        REG_S32(INEPTSFSAV,16); // 0x918
        REGDEF_R(0x91C);
REGDEF_DEF_END(usb, dreg_di_set, RSZ_DIEP);

REGDEF_BLOCK_BEGIN()
        REGDEF_NAME(usb,depctl) DOEPCTL; // 0xB00
        REGDEF_R(0xB04);
        REGDEF_NAME(usb, doepint) DOEPINT; // 0xB08
        REGDEF_R(0xB0C);
        REGDEF_NAME(usb, deptsiz) DIEPTSIZ; // 0xB10
		REGDEF_R(0xB14);
		REGDEF_R(0xB18);
		REGDEF_R(0xB1C);
REGDEF_DEF_END(usb, dreg_do_set, RSZ_DOEP);

REGDEF_BLOCK_BEGIN()
    REG_K32(MPSIZ, 11);
    REG_K32(EPNUM, 4);
    REG_B32(EPDIR);
    REG_RB();
    REG_B32(LSDEV);
    REG_K32(EPTYP, 2);
    REG_K32(MCNT, 2);
    REG_K32(DAD, 7);
    REG_B32(ODDFRM);
    REG_B32(CHDIS);
    REG_B32(CHENA);
REGDEF_BLOCK_END(usb, hcchar);

REGDEF_BLOCK_BEGIN()
	REG_K32(PRTADDR, 7);
	REG_K32(HUBADDR, 7);
	REG_K32(XACTPOS, 2);
	REG_B32(COMPLSPLT);
	REG_R(14);
	REG_B32(SPLTEN);
REGDEF_BLOCK_END(usb,hcsplt);

REGDEF_BLOCK_BEGIN()
	REG_B32(XFRC);
	REG_B32(CHH);
	REG_RB();
	REG_B32(STALL);
	REG_B32(NAK);
	REG_B32(ACK);
	REG_RB();
	REG_B32(TXERR);
	REG_B32(BBERR);
	REG_B32(FRMOR);
	REG_B32(DTERR);
	REG_R(21);
REGDEF_BLOCK_END(usb, hcint);

REGDEF_BLOCK_BEGIN()
    REG_K32(XFRSIZ, 19);
    REG_K32(PKTCNT, 10);
    REG_K32(DPID, 2);
    REG_B32(DOPING);
REGDEF_BLOCK_END(usb, hctsiz);

REGDEF_BLOCK_BEGIN()
        REGDEF_NAME(usb, hcchar) HCCHAR; 	// 0x500
        REGDEF_NAME(usb, hcsplt) HCSPLT; 	// 0x504
        REGDEF_NAME(usb, hcint)  HCINT;  	// 0x508
        REGDEF_NAME(usb, hcint)  HCINTMSK;  // 0x50C
        REGDEF_NAME(usb, hctsiz) HCTSIZ;    // 0x510
        uint32_t HCDMA;     // 0x514
		REGDEF_R(0x518); // Padding (HCDMAB on DWC2)
        REGDEF_R(0x51C);
REGDEF_DEF_END(usb, hreg, RSZ_HREG);

REGDEF_BLOCK_BEGIN()
	REG_B32(SUSPSTS);
	REG_K32(ENUMSPD, 2);
	REG_B32(EERR);
	REG_R(4);
	REG_K32(FNSOF,14);
	REG_R(10);
REGDEF_BLOCK_END(usb, dsts);

enum {
	DSTS_SPEED_HS,
	DSTS_SPEED_FS_HSPHY,
	DSTS_SPEED_LS,
	DSTS_SPEED_FS,
};

REGDEF_BLOCK_BEGIN()
	REG_K32(IEP,16);
	REG_K32(OEP,16);
REGDEF_BLOCK_END(usb, dep_int);

REGDEF_BLOCK_BEGIN()
	REG_B32(XFRCM);
	REG_B32(EPDM);
	REG_B32(AHBERRM);
	REG_B32(TOM);
	REG_B32(ITTXFEMSK);
	REG_B32(INEPNMM);
	REG_B32(INEPNEM);
	REG_RB();
	REG_B32(TXFURM);
	REG_R(4);
	REG_B32(NAKM);
	REG_R(18);
REGDEF_BLOCK_END(usb, diepmsk);

REGDEF_BLOCK_BEGIN();
	REG_B32(XFRCM);
	REG_B32(EPDM);
	REG_B32(AHBERRM);
	REG_B32(STUPM);
	REG_B32(OTEPDM);
	REG_B32(STSPHSRXM);
	REG_B32(B2BSTIP);
	REG_RB();
	REG_B32(OPEM);
	REG_R(3);
	REG_B32(BERRM);
	REG_B32(NAKMSK);
	REG_B32(NYETMSK);
	REG_R(17);
REGDEF_BLOCK_END(usb,doepmsk);

REGDEF_BLOCK_BEGIN()
	REG_B32(CMOD);
	REG_B32(MMIS);
	REG_B32(OTGINT);
	REG_B32(SOF);
	REG_B32(RXFLVL);
	REG_B32(NPTXFE);
	REG_B32(GINAKEFF);
	REG_B32(GONAKEFF);
	REG_R(2);
	REG_B32(ESUSP);
	REG_B32(USBSUSP);
	REG_B32(USBRST);
	REG_B32(ENUMDNE);
	REG_B32(ISOODRP);
	REG_B32(EOPF);
	REG_R(2);
	REG_B32(IEPINT);
	REG_B32(OEPINT);
	REG_B32(ISOIXFR);
	REG_B32(IPXFR);
	REG_R(2);
	REG_B32(HPRTINT);
	REG_B32(HCINT);
	REG_B32(PTXFE);
	REG_RB();
	REG_B32(CIDSCHG);
	REG_B32(DISCINT);
	REG_B32(SRQINT);
	REG_B32(WKUINT);
REGDEF_BLOCK_END(usb, gintsts);

struct STM32F4xxUSBState {
    /*< private >*/
    STM32Peripheral parent_obj;

