vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
	MemoryRegion* cpu_mr;
	AddressSpace cpu_as;

    /*< public >*/
    USBBus bus;
    qemu_irq irq;
    MemoryRegion container;
    MemoryRegion hsotg;
    MemoryRegion fifos;

    union {
#define STM32F4xx_GLBREG_SIZE    0x70
        uint32_t glbreg[STM32F4xx_GLBREG_SIZE / sizeof(uint32_t)];
        struct {
            uint32_t gotgctl;       /* 00 */
            uint32_t gotgint;       /* 04 */
            uint32_t gahbcfg;       /* 08 */
            uint32_t gusbcfg;       /* 0c */
            uint32_t grstctl;       /* 10 */
			REGDEF_NAME(usb, gintsts) GINTSTS; // 0x14
            uint32_t gintmsk;       /* 18 */
            union {
                uint32_t grxstsr;       /* 1c */
                REGDEF_NAME(usb, rxstatus) defs;
            } QEMU_PACKED ;
            uint32_t grxstsp;       /* 20 */
            uint32_t grxfsiz;       /* 24 */
            union {
                uint32_t gnptxfsiz;     /* 28 */
                struct {
                    uint32_t gnptxfsiz_txfsa  :16;
                    uint32_t gnptxfsiz_txfd   :16;
                } QEMU_PACKED;
            };
            uint32_t gnptxsts;      /* 2c */
            uint32_t gi2cctl;       /* 30 */
            uint32_t gpvndctl;      /* 34 */
            uint32_t ggpio;         /* 38 */
            uint32_t guid;          /* 3c */
            uint32_t gsnpsid;       /* 40 */
            uint32_t ghwcfg1;       /* 44 */
            uint32_t ghwcfg2;       /* 48 */
            uint32_t ghwcfg3;       /* 4c */
            uint32_t ghwcfg4;       /* 50 */
            uint32_t glpmcfg;       /* 54 */
            uint32_t gpwrdn;        /* 58 */
            uint32_t gdfifocfg;     /* 5c */
            uint32_t gadpctl;       /* 60 */
            uint32_t grefclk;       /* 64 */
            uint32_t gintmsk2;      /* 68 */
            uint32_t gintsts2;      /* 6c */
        };
    };

    union {
#define STM32F4xx_FSZREG_SIZE    0x04
        uint32_t fszreg[STM32F4xx_FSZREG_SIZE / sizeof(uint32_t)];
        struct {
            uint32_t hptxfsiz;      /* 100 */
        };
    };

    union {
#define STM32F4xx_HREG0_SIZE     0x44
        uint32_t hreg0[STM32F4xx_HREG0_SIZE / sizeof(uint32_t)];
        struct {
            uint32_t hcfg;          /* 400 */
            uint32_t hfir;          /* 404 */
            uint32_t hfnum;         /* 408 */
            uint32_t rsvd0;         /* 40c */
            uint32_t hptxsts;       /* 410 */
            uint32_t haint;         /* 414 */
            uint32_t haintmsk;      /* 418 */
            uint32_t hflbaddr;      /* 41c */
            uint32_t rsvd1[8];      /* 420-43c */
            union {
                struct {
                    REG_B32(PCSTS);
                    REG_B32(PCDET);
                    REG_B32(PENA);
                    REG_B32(PENCHNG);
                    REG_B32(POCA);
                    REG_B32(POCCHNG);
                    REG_B32(PRES);
                    REG_B32(PSUSP);
                    REG_B32(PRST);
                    REG_B32(_reserved);
                    uint32_t PLSTS :2;
                    REG_B32(PPWR);
                    uint32_t PTCTL :4;
                    uint32_t PSPD :2;
                    uint32_t :13;
                } QEMU_PACKED HPRT;
                uint32_t hprt0;         /* 440 */
            };
        };
    };

    union {
        uint32_t hreg1[STM32F4xx_NB_CHAN*RSZ_HREG];
        REGDEF_NAME(usb, hreg) hreg_chan[STM32F4xx_NB_CHAN];
    };

#define STM32F4xx_HREG1_SIZE     (0x20 * STM32F4xx_NB_CHAN)
    // uint32_t hreg1[STM32F4xx_HREG1_SIZE / sizeof(uint32_t)];

    union {
#define STM32F4xx_PCGREG_SIZE    0x08
        uint32_t pcgreg[STM32F4xx_PCGREG_SIZE / sizeof(uint32_t)];
        struct {
            uint32_t pcgctl;        /* e00 */
            uint32_t pcgcctl1;      /* e04 */
        };
    };

// Device mode register definitions.
    union {
        uint32_t dreg0[0x84];
        struct {
            struct {
                uint32_t DSPD :2;
                REG_B32(NZLSOHSK);
                REG_B32(_reserved);
                uint32_t DAD :7;
                uint32_t PFLVL :2;
                uint32_t _reserved2 :11;
                uint32_t PERSCHVL :2;
                uint32_t :6;
            } QEMU_PACKED DCFG; // 0x800
            struct {
                REG_B32(RWUSIG);
                REG_B32(SDIS);
                REG_B32(GINSTS);
                REG_B32(GONSTS);
                uint32_t TCTL :3;
                REG_B32(SGINAK);
                REG_B32(CGINAK);
                REG_B32(SGONAK);
                REG_B32(CGONAK);
                REG_B32(POPRGDNE);
                uint32_t :20;
            } QEMU_PACKED DCTL; // 0x804
            REGDEF_NAME(usb, dsts) DSTS; // 0x808
            REGDEF_R(0x80C);
            REGDEF_NAME(usb, diepmsk) DIEPMSK; // 0x810
            REGDEF_NAME(usb, doepmsk) DOEPMSK; // 0x814
			REGDEF_NAME(usb,dep_int) DAINT; // 0x818
			REGDEF_NAME(usb,dep_int) DAINTMSK; // 0x81C
            uint32_t _unused2[2]; // 0x820-4
            REG_S32(VBUSDT,16); // 0x828
            REG_S32(DVBUSP, 12); // 0x82C
            struct {
                REG_B32(NONISOTHREN);
                REG_B32(ISOTHREN);
                uint32_t TXTHRLEN :9;
                uint32_t _reserved :5;
                REG_B32(RXTHREN);
                uint32_t RXTHRLEN :9;
                REG_B32(_reserved2);
                REG_B32(ARPEN);
                uint32_t :4;
            } QEMU_PACKED DTHRCTRL; // 0x830;
            REG_S32(INEPTXFEM, 16); // 0x834;
            struct {
                REG_B32(_reserved);
                REG_B32(IEP1INT);
                uint32_t _reserved2 :15;
                REG_B32(OEP1INT);
                uint32_t :14;
            } QEMU_PACKED DEACHINT; // 0x838
            struct {
                REG_B32(_reserved);
                REG_B32(IEP1INTM);
                uint32_t _reserved2 :15;
                REG_B32(OEP1INTM);
                uint32_t :14;
            } QEMU_PACKED DEACHINTMSK; // 0x83C
            uint32_t _unused3; // 0x840
            struct {
                REG_B32(XFRCM);
                REG_B32(EPDM);
                REG_B32(AHBERRM);
                REG_B32(TOM);
                REG_B32(ITTXFEMSK);
                REG_B32(INEPNMM);
                REG_B32(INEPNEM);
                REG_B32(_reserved);
                REG_B32(TXFURM);
                REG_B32(BIM);
                uint32_t _reserved2 :3;
                REG_B32(NAKM);
                uint32_t :18;
            } QEMU_PACKED DIEPEACHMSK1; // 0x844
            uint32_t _reserved[0x20/4];
            struct {
                REG_B32(XFRCM);
                REG_B32(EPDM);
                REG_B32(AHBERRM);
                REG_B32(TOM);
                 REG_B32(ITTXFEMSK);
                REG_B32(INEPNMM);
                REG_B32(INEPNEM);
                REG_B32(_reserved);
                REG_B32(TXFURM);
                REG_B32(BIM);
                uint32_t _reserved2 :3;
                REG_B32(BERRM);
                REG_B32(NAKMSK);
                REG_B32(NYETM);
                uint32_t :17;
            } QEMU_PACKED DOEPEACHMSK1; // 0x884
        } QEMU_PACKED dreg_defs;
    };

    REGDEF_NAME(usb, dreg_di_set) dregi[STM32F4xx_NB_DEVCHAN];
    REGDEF_NAME(usb, dreg_do_set) drego[STM32F4xx_NB_DEVCHAN];

    /* TODO - implement FIFO registers for slave mode */
#define STM32F4xx_HFIFO_SIZE     (0x1000 * STM32F4xx_NB_CHAN)

