vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
    /*
     *  Internal state
     */
    QEMUTimer *eof_timer;
    QEMUTimer *frame_timer;
    QEMUTimer *cdc_timer;
    QEMUBH *async_bh;
    int64_t sof_time;
    int64_t usb_frame_time;
    int64_t usb_bit_time;
    uint32_t usb_version;
    uint16_t frame_number;
    uint16_t fi;
    uint16_t next_chan;
    bool working;
    USBPort uport;
    STM32F4xxPacket packet[STM32F4xx_NB_CHAN];                   /* one packet per chan */
    uint8_t usb_buf[STM32F4xx_NB_CHAN][STM32F4xx_MAX_XFER_SIZE]; /* one buffer per chan */


    // TODO- rework this into blocks on a per-channel basis
    // so the math is easier on my head...
    uint32_t fifo_ram[STM32F4xx_RX_FIFO_SIZE]; // 128K FIFO ram (0x20000- 0x3FFFF)
    // TODO - relocate these and use the correct registers instead.
    // #channels *4KiB of space.
    uint32_t tx_fifos[STM32F4xx_NB_CHAN][STM32F4xx_EP_FIFO_SIZE];

    uint16_t fifo_head[STM32F4xx_NB_CHAN];
    uint16_t fifo_level[STM32F4xx_NB_CHAN];
    uint16_t fifo_tail[STM32F4xx_NB_CHAN];
    uint32_t rx_fifo_head;
    uint32_t rx_fifo_tail;
    uint32_t rx_fifo_level;
    uint8_t is_ping;

    uint8_t device_state;
    uint8_t rx_next_packet;

	// Dev mode storage block:
		USB_DEVICE_DESCRIPTOR dev_descriptor;
	// -- End storage block:
#if USBIP_ENABLED
    // ALERT: this stuff crosses thread boundaries!
        pthread_t usbip_thread;
        pthread_mutex_t usbip_rx_mtx;
        uint32_t usbip_rx_buffer[STM32F4xx_EP_FIFO_SIZE];
        uint32_t usbip_rx_level;
        uint32_t usbip_tx_wlen;
        pthread_mutex_t usbip_tx_mtx;
        uint32_t usbip_tx_buffer[STM32F4xx_EP_FIFO_SIZE];
        uint32_t usbip_tx_level;
        uint16_t usbip_pending_tx_size[STM32F4xx_NB_CHAN];
        uint16_t usbip_pending_tx_bytes[STM32F4xx_NB_CHAN];
        pthread_cond_t usip_reply_ready;
        usbip_cfg_t usbip_cfg;
    // END ALERT
#endif
    bool debug;

    bool disable_sofi;

	bool is_device_mode;

    char cdc_in;

    /* Initial dwDTERate sent in SET_LINE_CODING. Buddy FW gates syslog routing on
       57600 (default) and Marlin console on 115200; FW may then re-set it later. */
    uint32_t cdc_baud;

    CharFrontend cdc;

};

struct STM32F4xxClass {
    /*< private >*/
    STM32PeripheralClass parent_class;
    ResettablePhases parent_phases;

    /*< public >*/
};

OBJECT_DECLARE_TYPE(STM32F4xxUSBState, STM32F4xxClass, STM32F4xx_USB)

/* USBIP handling */
#define BSIZE 64
char buffer[BSIZE+1];
int  bsize=0;

#define DEV_ADDR  4U
static const uint32_t DEV_SETADDR[] = {0x000C0040,  (0x00000500 | (DEV_ADDR<<16)), 0x00000000};
static const uint32_t DEV_GETDEV[] = {0x000C0040, 0x01000680, 0x00120000};
static const uint32_t DEV_GETDESC[] = {0x000C0040, 0x03020680, 0x00FF0000};
static const uint32_t DEV_GETDESC2[] = {0x000C0040, 0x03010680, 0x00FF0000};
static const uint32_t DEV_GETDESC3[] = {0x000C0040, 0x03030680, 0x00FF0000};
static const uint32_t DEV_SETCONF[] = {0x000C0040, 0x00010900, 0x00000000};
// SET_LINE_CODING SETUP packet: bmRequestType=0x21 (H->D, class, interface), bRequest=0x20, wLength=7.
// Packet header: PKTSTS=SETUP(6), BCNT=4 (FW reads 8 bytes regardless).
static const uint32_t DEV_SETCODING[] = {0x000C0040, 0x00002021, 0x00070000};
// OUT data stage: 7 bytes of line coding (dwDTERate[4], bCharFormat[1], bParityType[1], bDataBits[1]).
// dwDTERate is patched at runtime from the cdc_baud device property; bDataBits=8 in the high byte of the third word.
// Packet header: PKTSTS=OUT(2), BCNT=7.
#define DEV_SETCODING2_HEADER 0x00040070u
#define DEV_SETCODING2_TAIL   0x00080000u   /* bCharFormat=0 (1 stop), bParityType=0 (none), bDataBits=8 */
static const uint32_t DEV_SETCTLLINE[] = {0x000C0040, 0x00032221, 0x00000000};
static const uint32_t DEV_OUT_HEADER = 0x40012;
static const uint32_t DEV_OUT_AT[] = {0x00040022, 0x00000a0d};
//void handle_data(int sockfd, USBIP_RET_SUBMIT *usb_req, int bl)

#define DEVSTATE(name) DEV_ST_##name, DEV_ST_##name##_WAIT,

typedef union {
    uint32_t raw;
    struct {
        uint32_t CHNUM :4;
        uint32_t BCNT :11;
        uint32_t DPID :2;
        uint32_t PKTSTS :4;
        uint32_t :11;
    } QEMU_PACKED HOST;
    struct {
        uint32_t EPNUM :4;
        uint32_t BCNT :11;
        uint32_t DPID :2;
        uint32_t PKTSTS :4;
        uint32_t FRMNUM :4;
        uint32_t :6;
        REG_B32(INCOMPLETE); // NB- this isn't used by the device, rather by us to handle multi-packet IN transfers.
    } QEMU_PACKED DEV;
} buffer_header_t;

enum {
    BUFFER_PKTSTS_GNAK = 1U,
    BUFFER_PKTSTS_OUT = 2U,
    BUFFER_PKTSTS_OUTCPLT = 3U,
    BUFFER_PKTSTS_SETUPCPLT = 4U,
    BUFFER_PKTSTS_SETUP = 6U
};

 enum {
     DEVSTATE(RESET)
     DEVSTATE(SETUP)
	 DEVSTATE(GETDEV)
//	 DEV_ST_GETDEV_DONE,
     DEVSTATE(GETDESCR)
     DEVSTATE(GETDESCR2)
     DEVSTATE(GETDESCR3)
     DEVSTATE(SETCFG)
     DEVSTATE(LINECODING)
    //  DEVSTATE(LINECODING_DATA)
     DEV_ST_LINECODING_STATUS_WAIT,
     DEVSTATE(SETCTLLINE)
     DEV_ST_IO_READY,
     DEVSTATE(USBIP)
     //DEVSTATE(IO)
};



static inline uint32_t f4xx_usb_get_daint(STM32F4xxUSBState *s)
{
	REGDEF_NAME(usb, dep_int) daint = {.raw = 0};

	for(int i=0; i<STM32F4xx_NB_DEVCHAN; i++)
	{
		if (s->drego[i].DOEPINT.raw & s->dreg_defs.DOEPMSK.raw)
		{
			daint.OEP |= 1U << i;
		}
		if ((s->dregi[i].DIEPINT.raw & s->dreg_defs.DIEPMSK.raw) ||
			((s->fifo_level[i] == 0) && (s->dreg_defs.INEPTXFEM & (1U<<i))))
		{
			if (s->fifo_level[i] == 0)
			{
				s->dregi[i].DIEPINT.TXFE = 1;
			}
			daint.IEP |= 1U << i;
		}
	}
	return daint.raw;
}

/* update irq line */
static inline void STM32F4xx_update_irq(STM32F4xxUSBState *s)
{
    static int oldlevel;
    int level = 0;

    if ((s->GINTSTS.raw & s->gintmsk) && (s->gahbcfg & GAHBCFG_GLBL_INTR_EN)) {
        level = 1;
    }
    if (level != oldlevel) {
        oldlevel = level;
        // trace_usb_stm_update_irq(level);
        qemu_set_irq(s->irq, level);
    }
}

/* flag interrupt condition */
static inline void STM32F4xx_raise_global_irq(STM32F4xxUSBState *s, uint32_t intr)
{
    if (!(s->GINTSTS.raw & intr)) {
        s->GINTSTS.raw |= intr;
        // trace_usb_stm_raise_global_irq(intr);
        STM32F4xx_update_irq(s);

