vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
    }
}

static inline void STM32F4xx_lower_global_irq(STM32F4xxUSBState *s, uint32_t intr)
{
    if (s->GINTSTS.raw & intr) {
        s->GINTSTS.raw &= ~intr;
        // trace_usb_stm_lower_global_irq(intr);
        STM32F4xx_update_irq(s);
    }
}

static inline void STM32F4xx_raise_host_irq(STM32F4xxUSBState *s, uint32_t host_intr)
{
    if (!(s->haint & host_intr)) {
        s->haint |= host_intr;
        s->haint &= 0xffff;
        // trace_usb_stm_raise_host_irq(host_intr);
        if (s->haint & s->haintmsk) {
            STM32F4xx_raise_global_irq(s, GINTSTS_HCHINT);
        }
    }
}

static inline void STM32F4xx_lower_host_irq(STM32F4xxUSBState *s, uint32_t host_intr)
{
    if (s->haint & host_intr) {
        s->haint &= ~host_intr;
        // trace_usb_stm_lower_host_irq(host_intr);
        if (!(s->haint & s->haintmsk)) {
            STM32F4xx_lower_global_irq(s, GINTSTS_HCHINT);
        }
    }
}


static inline void STM32F4xx_update_hc_irq(STM32F4xxUSBState *s, int index)
{
    uint32_t host_intr = 1 << (index >> 3);
    uint32_t chan = index>>3;

    if (s->hreg_chan[chan].HCINT.raw & s->hreg_chan[chan].HCINTMSK.raw) {
        STM32F4xx_raise_host_irq(s, host_intr);
    } else {
        STM32F4xx_lower_host_irq(s, host_intr);
    }
}

static inline void STM32F4xx_update_device_common_irq(STM32F4xxUSBState *s)
{
    uint32_t new_daint = f4xx_usb_get_daint(s);
    if (new_daint^s->dreg_defs.DAINT.raw)
    {
        // There's a change in the common reg. Update global accordingly.
        s->dreg_defs.DAINT.raw = new_daint;
        if (s->dreg_defs.DAINT.OEP & s->dreg_defs.DAINTMSK.OEP)
        {
            printf("Raising OEPINT\n");
            STM32F4xx_raise_global_irq(s, GINTSTS_OEPINT);
        }
        else
        {
            printf("Lowering OEPINT\n");
            STM32F4xx_lower_global_irq(s, GINTSTS_OEPINT);
        }
        if (s->dreg_defs.DAINT.IEP & s->dreg_defs.DAINTMSK.IEP)
        {
            printf("Raising IEPINT\n");
            STM32F4xx_raise_global_irq(s, GINTSTS_IEPINT);
        }
        else
        {
            printf("Lowering IEPINT\n");
            STM32F4xx_lower_global_irq(s, GINTSTS_IEPINT);
        }
    }
}

static inline void STM32F4xx_raise_device_ep_out_irq(STM32F4xxUSBState *s, int ep, uint32_t dev_intr)
{
    if (!(s->drego[ep].DOEPINT.raw & dev_intr))
    {
        printf ("EP out %d %06X v-> %06X\n", ep,  s->drego[ep].raw[RO_DOEPINT], s->drego[ep].raw[RO_DOEPINT] | ~dev_intr);
        s->drego[ep].DOEPINT.raw |= dev_intr;
        STM32F4xx_update_device_common_irq(s);
    }
}

static inline void STM32F4xx_lower_device_ep_out_irq(STM32F4xxUSBState *s, int ep, uint32_t dev_intr)
{
    if (s->drego[ep].DOEPINT.raw & dev_intr)
    {
        printf ("EP out %d %06X v-> %06X\n", ep,  s->drego[ep].raw[RO_DOEPINT], s->drego[ep].raw[RO_DOEPINT] & ~dev_intr);
        s->drego[ep].DOEPINT.raw &= ~dev_intr;
        STM32F4xx_update_device_common_irq(s);
    }
}

static inline void STM32F4xx_raise_device_ep_in_irq(STM32F4xxUSBState *s, int ep, uint32_t dev_intr)
{
    if (!(s->dregi[ep].DIEPINT.raw & dev_intr))
    {
        printf ("EP in %d %06X ^-> %06X\n", ep,  s->dregi[ep].raw[RO_DIEPINT], s->dregi[ep].raw[RO_DIEPINT] | ~dev_intr);
        s->dregi[ep].DIEPINT.raw |= dev_intr;
        STM32F4xx_update_device_common_irq(s);
    }
}

static inline void STM32F4xx_lower_device_ep_in_irq(STM32F4xxUSBState *s, int ep, uint32_t dev_intr)
{
    if (s->dregi[ep].DIEPINT.raw & dev_intr)
    {
        printf ("EP in %d %06X v-> %06X\n", ep,  s->dregi[ep].raw[RO_DIEPINT], s->dregi[ep].raw[RO_DIEPINT] & ~dev_intr);
        s->dregi[ep].DIEPINT.raw &= ~dev_intr;
        STM32F4xx_update_device_common_irq(s);
    }
}
/* set a timer for EOF */
static void STM32F4xx_eof_timer(STM32F4xxUSBState *s)
{
    timer_mod(s->eof_timer, s->sof_time + s->usb_frame_time);
}

/* Set a timer for EOF and generate SOF event */
static void STM32F4xx_sof(STM32F4xxUSBState *s)
{
    s->sof_time += s->usb_frame_time;
    // trace_usb_stm_sof(s->sof_time);
    STM32F4xx_eof_timer(s);
    if (!s->disable_sofi) 
    {
        STM32F4xx_raise_global_irq(s, GINTSTS_SOF);
    }
}

/* Do frame processing on frame boundary */
static void STM32F4xx_frame_boundary(void *opaque)
{
    STM32F4xxUSBState *s = opaque;
    int64_t now;
    uint16_t frcnt;

    now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);

    /* Frame boundary, so do EOF stuff here */

    /* Increment frame number */
    frcnt = (uint16_t)((now - s->sof_time) / s->fi);
    s->frame_number = (s->frame_number + frcnt) & 0xffff;
    s->hfnum = s->frame_number & HFNUM_MAX_FRNUM;

    /* Do SOF stuff here */
    STM32F4xx_sof(s);
}

/* Start sending SOF tokens on the USB bus */
static void STM32F4xx_bus_start(STM32F4xxUSBState *s)
{
    trace_usb_stm_bus_start();
    s->sof_time = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    STM32F4xx_eof_timer(s);
}

/* Stop sending SOF tokens on the USB bus */
static void STM32F4xx_bus_stop(STM32F4xxUSBState *s)
{
    trace_usb_stm_bus_stop();
    timer_del(s->eof_timer);
}

static USBDevice *STM32F4xx_find_device(STM32F4xxUSBState *s, uint8_t addr)
{
    USBDevice *dev;

    trace_usb_stm_find_device(addr);

    if (!(s->HPRT.PENA)) {
        trace_usb_stm_port_disabled(0);
    } else {
        dev = usb_find_device(&s->uport, addr);
        if (dev != NULL) {
            trace_usb_stm_device_found(0);
            return dev;
        }
    }

    trace_usb_stm_device_not_found();
    return NULL;
}

static const char *pstatus[] = {
    "USB_RET_SUCCESS", "USB_RET_NODEV", "USB_RET_NAK", "USB_RET_STALL",
    "USB_RET_BABBLE", "USB_RET_IOERROR", "USB_RET_ASYNC",
    "USB_RET_ADD_TO_QUEUE", "USB_RET_REMOVE_FROM_QUEUE"
};

static uint32_t pintr[] = {
    HCINTMSK_XFERCOMPL, HCINTMSK_XACTERR, HCINTMSK_NAK, HCINTMSK_STALL,
    HCINTMSK_BBLERR, HCINTMSK_XACTERR, HCINTMSK_XACTERR, HCINTMSK_XACTERR,
    HCINTMSK_XACTERR
};

static const char *types[] = {
    "Ctrl", "Isoc", "Bulk", "Intr"
};

static const char *dirs[] = {
    "Out", "In"
};

