vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
// CDC block handlers:

static void STM32F4xx_cdc_schedule(STM32F4xxUSBState *s) {
    timer_mod(s->cdc_timer, qemu_clock_get_us(QEMU_CLOCK_VIRTUAL) + 100);
}

static int f4xx_usb_cdc_can_receive(void *opaque)
{
    STM32F4xxUSBState *s = STM32F4xx_USB(opaque);
    return s->cdc_in == 0 && s->drego[2].DIEPTSIZ.XFRSIZ == 64;
}

static void f4xx_usb_cdc_receive(void *opaque, const uint8_t *buf, int size)
{
    STM32F4xxUSBState *s = STM32F4xx_USB(opaque);

    assert(size > 0);
    /* Copy the characters into our buffer first */
    // if (s->periph==19) {
    s->cdc_in = buf[0];
        // printf("CDC RX: ");
        // for (int i=0; i<size;i++)
        //     printf("%c",buf[i]);
        // printf("\n");
    STM32F4xx_cdc_schedule(s);
    // }
    // TODO - forward chars to a packet.
}

static void f4xx_usb_cdc_sendpkt(STM32F4xxUSBState *s, const uint32_t* pBuff, const uint32_t len)
{
    for (int i=0; i<len; i++) {
        s->fifo_ram[i] = pBuff[i];
        s->rx_fifo_tail = len;
        s->rx_fifo_level = len;
        s->rx_fifo_head = 0;
    }
	STM32F4xx_raise_global_irq(s, GINTSTS_RXFLVL);
}

// Responsible for the initial handshake once device mode is enabled.
static void f4xx_usb_cdc_setup(STM32F4xxUSBState *s)
{
	if (!qemu_chr_fe_backend_connected(&s->cdc))
	{
		return; // No chardev attached.
	}
	// if (s->debug) printf("USB CDC state: %u\n", s->device_state);
    switch (s->device_state) {
        case DEV_ST_RESET:
        {
            STM32F4xx_raise_global_irq(s, GINTSTS_CONIDSTSCHNG | GINTSTS_USBRST | GINTSTS_ENUMDONE);
            s->device_state = DEV_ST_RESET_WAIT;
        }
        break;
		case DEV_ST_SETUP:
        {
            s->device_state = DEV_ST_SETUP_WAIT;
            // Construct ctl set address packet:
            f4xx_usb_cdc_sendpkt(s, DEV_SETADDR, sizeof(DEV_SETADDR)/sizeof(uint32_t));
            STM32F4xx_raise_device_ep_out_irq(s, 0, DOEPMSK_SETUPMSK);
        }
		break;
		case DEV_ST_SETUP_WAIT:
		{
            s->dregi[0].DIEPCTL.EPENA = 0;
			if (!qemu_chr_fe_backend_connected(&s->cdc))
			{
#if USBIP_ENABLED
				// USBIP mode since there is no attached chardev.
				// Start the thread.
				if (s->usbip_thread)
				{
					printf("USBIP thread already running...\n");
				}
				else
				{
					// printf("Starting USB IP thread...\n");
					// pthread_create(&s->usbip_thread, NULL, usbip_thread_run, (void*)&s->usbip_cfg);
				}
           		s->device_state = DEV_ST_USBIP;
            	timer_mod(s->cdc_timer, qemu_clock_get_us(QEMU_CLOCK_VIRTUAL) + 1000);
#endif
			}
			else
			{
            	s->device_state = DEV_ST_GETDEV;
            	STM32F4xx_cdc_schedule(s);
			}
            break;
		}
		break;
		case DEV_ST_GETDEV:
		{
			s->device_state = DEV_ST_GETDEV_WAIT;
			f4xx_usb_cdc_sendpkt(s, DEV_GETDEV, sizeof(DEV_GETDEV)/sizeof(uint32_t));
            STM32F4xx_raise_device_ep_out_irq(s, 0, DOEPMSK_SETUPMSK);
		}
        break;
		case DEV_ST_GETDESCR:
		case DEV_ST_GETDESCR2:
		case DEV_ST_GETDESCR3:
            switch (s->device_state) {
                case DEV_ST_GETDESCR:
                    f4xx_usb_cdc_sendpkt(s, DEV_GETDESC, sizeof(DEV_GETDESC)/sizeof(uint32_t));
                    break;
                case DEV_ST_GETDESCR2:
                    f4xx_usb_cdc_sendpkt(s, DEV_GETDESC2, sizeof(DEV_GETDESC2)/sizeof(uint32_t));
                    break;
                case DEV_ST_GETDESCR3:
                    f4xx_usb_cdc_sendpkt(s, DEV_GETDESC3, sizeof(DEV_GETDESC3)/sizeof(uint32_t));
                    break;
            }
            s->device_state++;
            //STM32F4xx_raise_device_ep_in_irq(s, 0, DIEPMSK_TXFIFOEMPTY);
            STM32F4xx_raise_device_ep_out_irq(s, 0, DOEPMSK_SETUPMSK);
        break;
		case DEV_ST_SETCFG:
		   	f4xx_usb_cdc_sendpkt(s, DEV_SETCONF, sizeof(DEV_SETCONF)/sizeof(uint32_t));
            STM32F4xx_raise_device_ep_out_irq(s, 0, DOEPMSK_SETUPMSK);
            s->device_state++;
		break;
		case DEV_ST_SETCFG_WAIT:
			s->device_state = DEV_ST_LINECODING;
		/* FALLTHRU */
		case DEV_ST_LINECODING:
			f4xx_usb_cdc_sendpkt(s, DEV_SETCODING, sizeof(DEV_SETCODING)/sizeof(uint32_t));
            STM32F4xx_raise_device_ep_out_irq(s, 0, DOEPMSK_SETUPMSK);
			s->device_state++;
			break;
		case DEV_ST_LINECODING_WAIT:
		{
			/* FW armed EP0 OUT for the data stage of SET_LINE_CODING. Push the 7
			   bytes of line coding (dwDTERate, bCharFormat, bParityType, bDataBits)
			   into the RX FIFO. dwDTERate comes from the cdc_baud property. */
			uint32_t pkt[3];
			pkt[0] = DEV_SETCODING2_HEADER;
			pkt[1] = s->cdc_baud;            /* dwDTERate (bytes 0-3) */
			pkt[2] = DEV_SETCODING2_TAIL;    /* byte 4=charfmt, 5=parity, 6=databits=8 */
			f4xx_usb_cdc_sendpkt(s, pkt, ARRAY_SIZE(pkt));
			/* Real OTG decrements DOEPTSIZ.XFRSIZ by the bytes received. TinyUSB
			   computes xferred_bytes = total_len - DOEPTSIZ.XFRSIZ on a short packet
			   (dcd_dwc2.c handle_rxflvl_irq OUTRX path); if we don't update XFRSIZ,
			   FW sees xferred=0, the memcpy into &p_cdc->line_coding copies nothing,
			   bit_rate stays at TinyUSB's 115200 default and line_coding_cb fires
			   switch_to_marlin instead of switch_to_logging. */
			if (s->drego[0].DIEPTSIZ.XFRSIZ >= 7) {
				s->drego[0].DIEPTSIZ.XFRSIZ -= 7;
			} else {
				s->drego[0].DIEPTSIZ.XFRSIZ = 0;
			}
            STM32F4xx_raise_device_ep_out_irq(s, 0, DOEPMSK_XFERCOMPLMSK);
            /* Don't auto-advance — wait for FW to arm EP0 IN for the status ZLP.
               That EPENA write triggers cdc_schedule via STM32F4xx_dregin_write. */
			s->device_state++;   /* -> DEV_ST_LINECODING_STATUS_WAIT */
			break;
		}
		case DEV_ST_LINECODING_STATUS_WAIT:
			/* FW armed DIEP0 EPENA with PKTCNT=1, XFRSIZ=0 to send the status-IN
			   ZLP that ACKs SET_LINE_CODING. Consume it and advance. */
			s->fifo_head[0] = s->fifo_tail[0] = s->fifo_level[0] = 0;
			s->dregi[0].DIEPTSIZ.XFRSIZ = 0;
			if (s->dregi[0].DIEPTSIZ.PKTCNT > 0) {
				s->dregi[0].DIEPTSIZ.PKTCNT--;
			}
			s->dregi[0].DIEPCTL.EPENA = 0;
			STM32F4xx_raise_device_ep_in_irq(s, 0, DIEPMSK_XFERCOMPLMSK);
			STM32F4xx_update_device_common_irq(s);
			s->device_state = DEV_ST_SETCTLLINE;
			STM32F4xx_cdc_schedule(s);
			break;
		case DEV_ST_SETCTLLINE:
            f4xx_usb_cdc_sendpkt(s, DEV_SETCTLLINE, sizeof(DEV_SETCTLLINE)/sizeof(uint32_t));
            STM32F4xx_raise_device_ep_out_irq(s, 0, DOEPMSK_SETUPMSK);
            //printf("DOEPINT: %08x (bit %u)\n", s->drego[0].raw[R_OFF_DEPINT], s->drego[0].DOEPINT.STUP);
            s->device_state++;
            break;
		case DEV_ST_SETCTLLINE_WAIT:
			/* FW armed DIEP0 EPENA for the status-IN ZLP of SET_CONTROL_LINE_STATE.
			   Raise XFRC on EP0 IN so TinyUSB reaches CONTROL_STAGE_ACK and stores
			   p_cdc->line_state (which is what tud_cdc_connected() checks for DTR). */
			s->fifo_head[0] = s->fifo_tail[0] = s->fifo_level[0] = 0;
			s->dregi[0].DIEPTSIZ.XFRSIZ = 0;
			if (s->dregi[0].DIEPTSIZ.PKTCNT > 0) {
				s->dregi[0].DIEPTSIZ.PKTCNT--;
			}
			s->dregi[0].DIEPCTL.EPENA = 0;
			STM32F4xx_raise_device_ep_in_irq(s, 0, DIEPMSK_XFERCOMPLMSK);
			STM32F4xx_update_device_common_irq(s);
			printf("Control line set\n");
			s->device_state = DEV_ST_IO_READY;
			break;
		case DEV_ST_IO_READY:
            if (s->cdc_in!=0)
            {
                if (s->cdc_in == '\n')
                {
                    f4xx_usb_cdc_sendpkt(s, DEV_OUT_AT, sizeof(DEV_OUT_AT)/sizeof(uint32_t));
                    s->drego[2].DIEPTSIZ.XFRSIZ-=2;
                }
                else
                {
                    f4xx_usb_cdc_sendpkt(s, &DEV_OUT_HEADER, 1);
                    s->rx_fifo_level++;
                    s->rx_fifo_tail++;
                    s->fifo_ram[1] = 0 | (s->cdc_in);
                    s->drego[2].DIEPTSIZ.XFRSIZ--;
                }
                s->cdc_in = 0;
                STM32F4xx_raise_device_ep_out_irq(s, 2, DOEPMSK_XFERCOMPLMSK);
            }
			if (s->dregi[2].DIEPCTL.EPENA && s->dregi[2].DIEPTSIZ.PKTCNT == 1 && s->dregi[2].DIEPTSIZ.XFRSIZ == 0)
			{
				// Special case for padded packets that are multiples of the transfer size.
				// They end up here because no packet is ever sent. - just mark it done so CDC releases the endpoint
                STM32F4xx_raise_device_ep_in_irq(s, 2, DIEPMSK_XFERCOMPLMSK);
			}
		break;
#if USBIP_ENABLED
		case DEV_ST_USBIP:
		{
            bool has_data = false;
            uint32_t data_len = 0;
            bool do_ack = false;
			uint8_t epnum = 0;
            pthread_mutex_lock(&s->usbip_rx_mtx);
                data_len = s->usbip_rx_level;
                if (data_len)
                {
                    s->rx_fifo_head = 0;
                    memcpy(&s->fifo_ram[s->rx_fifo_head], s->usbip_rx_buffer, s->usbip_rx_level*sizeof(uint32_t));
                    s->usbip_rx_level = 0;
                    has_data = true;
                }
            pthread_mutex_unlock(&s->usbip_rx_mtx);
            if (has_data)
            {
				printf("Copied %u words to fifo\n",data_len);
                // There is data ready. Fire the interrupts.
                buffer_header_t h = {.raw = s->fifo_ram[s->rx_fifo_head]};
				epnum = h.DEV.EPNUM;
                s->rx_fifo_level = data_len;
                switch (h.DEV.PKTSTS)
                {
                    case BUFFER_PKTSTS_SETUP:
						if (h.DEV.INCOMPLETE)
						{
							s->device_state = DEV_ST_USBIP_WAIT;
							s->rx_next_packet = 3 + ((h.DEV.BCNT+3U)/4U);
						}
                    /* FALLTHRU */
                    case BUFFER_PKTSTS_SETUPCPLT:
                        STM32F4xx_raise_global_irq(s,GINTSTS_RXFLVL);
                        STM32F4xx_raise_device_ep_out_irq(s,0,DOEPMSK_SETUPMSK);
                        break;
                    case BUFFER_PKTSTS_OUT:
                        STM32F4xx_raise_global_irq(s,GINTSTS_RXFLVL);
                        STM32F4xx_raise_device_ep_out_irq(s,h.DEV.EPNUM,DOEPMSK_XFERCOMPLMSK);
                        do_ack = h.DEV.EPNUM>0;
                        break;
                    default:
                        printf("UNHANDLED PKTSTS for IRQ\n");
                }

