vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
            }
			if (do_ack)
			{
				// For ACKs that don't send data.
				pthread_mutex_lock(&s->usbip_tx_mtx);
				s->usbip_tx_buffer[0] = 0;
				s->dregi[epnum].DIEPCTL.EPENA = 0;
				s->dregi[epnum].DIEPTSIZ.PKTCNT--;
				printf("Outgoing USBIP ack on EP %d\n", epnum);
				pthread_cond_signal(&s->usip_reply_ready);
				pthread_mutex_unlock(&s->usbip_tx_mtx);
			}
		}
		timer_mod(s->cdc_timer, qemu_clock_get_us(QEMU_CLOCK_VIRTUAL) + 1000);
		break;
		case DEV_ST_USBIP_WAIT:
        {
            if (s->rx_next_packet && s->rx_next_packet == s->rx_fifo_tail)
            {
                buffer_header_t h = {.raw = s->fifo_ram[s->rx_fifo_tail]};
                if (!h.DEV.INCOMPLETE && h.DEV.PKTSTS == BUFFER_PKTSTS_OUT) {
                    {
                        printf("Second packet reached\n");
                        STM32F4xx_raise_device_ep_out_irq(s,0,DOEPMSK_SETUPMSK);
                        // STM32F4xx_raise_device_ep_out_irq(s,0,DOEPMSK_XFERCOMPLMSK);
                        s->rx_next_packet = 0;
                    }

                }
            }
            else if (s->rx_fifo_level == 0)
            {
                // Resume normal operations, packets have been read.
                printf("Second packet finished\n");
                STM32F4xx_raise_device_ep_out_irq(s,0,DOEPMSK_XFERCOMPLMSK);
                s->device_state = DEV_ST_USBIP;
            }
        }
        timer_mod(s->cdc_timer, qemu_clock_get_us(QEMU_CLOCK_VIRTUAL) + 1000);
        break;
#endif
		default:
			printf("FIXME: %s - don't know how to handle packet in state %d\n", __func__, s->device_state);
	}
}

static void STM32F4xx_cdc_helper(void* opaque) {
    f4xx_usb_cdc_setup((STM32F4xxUSBState *)opaque);
}

// end CDC handlers.
/*
static void STM32F4xx_usbip_handle_packet(USBIPIF *self, USBIP_CMD_SUBMIT* cmd, USBIP_RET_SUBMIT* usb_req)
{
    printf("Handle packet called: Setup: %llx\n", cmd->setup);
    STM32F4xxUSBState* s = STM32F4xx_USB(self);
    buffer_header_t header;
    char payload[255];
    uint8_t payload_size = 0;
    bool has_setup = false;
    header.raw = 0;
    header.DEV.EPNUM = usb_req->ep;
    header.DEV.BCNT = usb_req->actual_length;
    if (usb_req->direction && usb_req->ep == 0 && usb_req->actual_length == 0)
    {
        header.DEV.PKTSTS = BUFFER_PKTSTS_SETUP;
        has_setup = true;
    }
    else if (!usb_req->direction && usb_req->ep == 0 && usb_req->actual_length == 0)
    {
        if (cmd->transfer_buffer_length)
        {
            header.DEV.PKTSTS = BUFFER_PKTSTS_SETUP;
            header.DEV.INCOMPLETE = 1;
        }
        else
        {
            header.DEV.PKTSTS = BUFFER_PKTSTS_SETUP;
        }
        has_setup = true;
    }
    else if (usb_req->ep == 2 || usb_req->direction == 1)
    {
        // temporarily ignore EP2 interrupts and IN bulk
        return;
    }
    else if (usb_req->ep > 0 && usb_req->actual_length == 0)
    {
        header.DEV.PKTSTS = BUFFER_PKTSTS_OUT;
    }
    else
    {
        printf("UNHANDLED PKTSTS!\n");
    }
    if (cmd->transfer_buffer_length !=0 && cmd->direction == 0)
    {
        if (usbip_read_payload(&s->usbip_cfg, payload, cmd->transfer_buffer_length))
        {
            payload_size = cmd->transfer_buffer_length;
        }
        else
        {
            printf("XFER BUF LENGTH ERR\n");
        }
    }
    uint32_t word_count = sizeof(usb_req->setup)/sizeof(uint32_t);
	uint64_t setup_64 = usb_req->setup;
    uint32_t* setup_words = (uint32_t*)&setup_64;
    pthread_mutex_lock(&s->usbip_rx_mtx);
        s->usbip_rx_buffer[0] = header.raw;
        if (has_setup)
        {
            for (int i=0; i<word_count; i++)
            {
                s->usbip_rx_buffer[word_count-i] = ntohl(setup_words[i]);
            }
            // memcpy(&s->usbip_rx_buffer[1], &usb_req.setup, sizeof(usb_req.setup));
            s->usbip_rx_level = 1U + word_count;
        }
        if (payload_size)
        {
            // Add the data as an immediate second packet.
            assert(payload_size<255);
            header.DEV.BCNT = payload_size;
            header.DEV.INCOMPLETE = 0;
            header.DEV.PKTSTS = BUFFER_PKTSTS_OUT;
            s->usbip_rx_buffer[s->usbip_rx_level++] = header.raw;
            memcpy(&s->usbip_rx_buffer[s->usbip_rx_level], payload, payload_size);
            s->usbip_rx_level += ((payload_size+3)/4U);
        }
    pthread_mutex_unlock(&s->usbip_rx_mtx);
    pthread_mutex_lock(&s->usbip_tx_mtx);
    s->usbip_tx_wlen = cmd->transfer_buffer_length;
	printf("Waiting for reply pkt...\n");
    // if (reply_required)
    // {
        pthread_cond_wait(&s->usip_reply_ready, &s->usbip_tx_mtx);
    // }
    printf("SIG Reply ready\n");
    header.raw = s->usbip_tx_buffer[0];
    usbip_send_reply(&s->usbip_cfg, usb_req, (char*)&s->usbip_tx_buffer[1],header.DEV.BCNT,0);
    // Wipe data from buffer.
    s->usbip_tx_level = 0;
    pthread_mutex_unlock(&s->usbip_tx_mtx);
}
*/
// Packet handling for device mode (chardev CDC, or USBIP.)
static void STM32F4xx_usb_devmode_packet(STM32F4xxUSBState *s, int epnum)
{
	if (!qemu_chr_fe_backend_connected(&s->cdc))
	{
		return;
	}
	if (s->debug) printf("devmode packet: %d\n", s->device_state);
	switch (s->device_state)
	{
		case DEV_ST_GETDEV_WAIT:
		{
			memcpy(&s->dev_descriptor, &s->tx_fifos[0],sizeof(s->dev_descriptor));
			printf("Starting USB CDC mode with VID/PID %04x:%04x\n", s->dev_descriptor.idVendor, s->dev_descriptor.iProduct);
			qemu_chr_fe_write_all(&s->cdc, (const uint8_t*)"Starting CDC device mode\r\n", 27);
			s->fifo_head[0] = s->fifo_tail[0] = s->fifo_level[0] = 0;
			s->dregi[0].DIEPTSIZ.XFRSIZ = 0;
			//STM32F4xx_raise_device_ep_in_irq(s, 0, DIEPMSK_XFERCOMPLMSK);
			s->device_state = DEV_ST_GETDESCR;
			STM32F4xx_cdc_schedule(s);
		}
		break;
		case DEV_ST_GETDESCR_WAIT:
		case DEV_ST_GETDESCR2_WAIT:
		case DEV_ST_GETDESCR3_WAIT:
		{
			uint8_t buffer[255] = {0};
			uint8_t len  = ((uint8_t*)&s->tx_fifos[0])[0];
			//uint8_t type = ((uint8_t*)&s->tx_fifos[0])[1];
			for(int i=1; i<len/2; i++)
			{
				buffer[i-1] = ((uint16_t*)&s->tx_fifos[0])[i];
			}
			printf("USB device descriptor %s\n", buffer);
			qemu_chr_fe_write_all(&s->cdc, buffer, len/2);
			qemu_chr_fe_write(&s->cdc, (const uint8_t*)"\r\n",2);
			s->fifo_head[0] = s->fifo_tail[0] = s->fifo_level[0] = 0;
			s->dregi[0].DIEPTSIZ.XFRSIZ = 0;
			STM32F4xx_update_device_common_irq(s);
			STM32F4xx_cdc_schedule(s);
			s->device_state++;
		}
		break;
		case DEV_ST_SETCFG_WAIT ... DEV_ST_IO_READY:
		{
			if (epnum > 0)
			{
				//qemu_chr_fe_write_all(&s->cdc, (uint8_t*)s->tx_fifos[epnum], s->dregi[epnum].DIEPTSIZ.XFRSIZ);
				// qemu_chr_fe_write(&s->cdc, (const uint8_t*)"\r",1);
				uint8_t* ptr =(uint8_t*)s->tx_fifos[epnum];
				for (int i=0; i<s->dregi[epnum].DIEPTSIZ.XFRSIZ; i++)
				{
					if (*ptr == '\n')
					{
						qemu_chr_fe_write(&s->cdc, (const uint8_t*)"\r",1);
					}
					qemu_chr_fe_write(&s->cdc, ptr++,1);

