vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
				}
				STM32F4xx_lower_device_ep_in_irq(s, epnum, DIEPMSK_TXFIFOEMPTY);
				s->fifo_head[epnum] = s->fifo_tail[epnum] = s->fifo_level[epnum] = 0;
				s->dregi[epnum].DIEPTSIZ.XFRSIZ = 0;
				s->dregi[epnum].DIEPTSIZ.PKTCNT--;
					// s->dreg_defs.DAINT.IEP &= (~2U); // todo.. figure out why this doesn't clear when the fifo level does.
					// STM32F4xx_lower_global_irq(s, GINTSTS_IEPINT);
				STM32F4xx_raise_device_ep_in_irq(s, epnum, DIEPMSK_XFERCOMPLMSK);
				STM32F4xx_update_device_common_irq(s);
			}
		}
		break;
#if USBIP_ENABLED
		case DEV_ST_USBIP:
		{
			pthread_mutex_lock(&s->usbip_tx_mtx);
			buffer_header_t h = {.raw = 0};
			h.DEV.EPNUM = epnum;
			if (s->usbip_tx_level == 0) // For packets larger than EP max size, only put header on first buffer.
			{
				h.DEV.BCNT = s->usbip_pending_tx_bytes[epnum];
				s->usbip_tx_buffer[s->usbip_tx_level++] = h.raw;
			}
			else
			{
				h.raw = s->usbip_tx_buffer[0];
				if (s->debug) printf("Appending packet: %d ->",h.DEV.BCNT);
				h.DEV.BCNT += s->usbip_pending_tx_bytes[epnum];
				if (s->debug) printf("%d \n",h.DEV.BCNT);
				s->usbip_tx_buffer[0] = h.raw;
			}
			for (int wcnt=0; wcnt<s->fifo_level[epnum]; wcnt++) {
				s->usbip_tx_buffer[s->usbip_tx_level++] = (s->tx_fifos[epnum][s->fifo_head[epnum]+wcnt]);
			}
			// Reset the fifo.
			s->fifo_level[epnum] = 0;
			s->fifo_tail[epnum] = 0;
			//memcpy(&s->usbip_tx_buffer[s->usbip_tx_level],&s->tx_fifos[i][s->fifo_head[i]], s->fifo_level[i]*sizeof(uint32_t));
			if (s->usbip_tx_wlen == h.DEV.BCNT || (epnum == 0 && h.DEV.BCNT < 64U))
			{
				printf("Outgoing USBIP data on EP %d (%u words)\n", epnum, h.DEV.BCNT);
				pthread_cond_signal(&s->usip_reply_ready);
			}
			else
			{
				// Fake fifo empty interruptso we can receive more packets.
				// TODO: figure out why this hack is necessary and the int is disabled after the first 64B
				printf("Second half transfer prep\n");
				//s->dreg_defs.INEPTXFEM |=1;
				//STM32F4xx_raise_device_ep_in_irq(s, epnum, DIEPMSK_TXFIFOEMPTY);
				STM32F4xx_raise_device_ep_in_irq(s, epnum, DIEPMSK_XFERCOMPLMSK);
			}
			pthread_mutex_unlock(&s->usbip_tx_mtx);
		}
		break;
#endif
		default:
			printf("FIXME: %s - don't know how to handle packet in state %d\n", __func__, s->device_state);
	}
}

static void STM32F4xx_handle_packet(STM32F4xxUSBState *s, uint32_t devadr, USBDevice *dev,
                               USBEndpoint *ep, uint32_t index, bool send)
{

	if (s->is_device_mode)
	{
		printf("Device mode, rerouting USB packet\n");
		return STM32F4xx_usb_devmode_packet(s, index>>3);
	}
    STM32F4xxPacket *p;
    uint32_t chan = index >> 3;
    REGDEF_NAME(usb, hreg)* r_chan = &s->hreg_chan[chan];
    REGDEF_NAME(usb,hctsiz)* hctsiz = &r_chan->HCTSIZ;
    REGDEF_NAME(usb, hcchar)* hcchar = &r_chan->HCCHAR;
    uint32_t pid, tlen, intr = 0;
    uint32_t tpcnt, stsidx, actual = 0;
    bool do_intr = false, done = false;

    pid = hctsiz->DPID;
    assert(hctsiz->XFRSIZ <= STM32F4xx_MAX_XFER_SIZE);
    p = &s->packet[chan];

    if (hcchar->CHDIS)
    {
        printf("Channel %u disabled, ignoring.\n",chan);
        return;
    }

    if (hctsiz->DOPING){
        // Ping packet. just ACK it.
        if (!s->is_ping) {
            r_chan->HCINT.ACK |= r_chan->HCINTMSK.ACK;
            // s->hreg1[index + 4] &= ~TSIZ_DOPNG; // clear ping bit, it's done.
            // printf("PING ack'ed (EN: %u), tsiz: %08x\n",(hcchar & HCCHAR_CHDIS)>0, s->hreg1[index+4]);
            // s->hreg1[index] &= (~HCCHAR_CHENA);
            s->is_ping=true;
        } else if (s->is_ping<2){
            // Reenabled post-ping...
            // printf("Ping idling...\n");
        } else {
            s->is_ping = false;
            // printf("Ping complete\n");
            hcchar->CHENA = false;
        }
       // s->is_ping = true;
        STM32F4xx_update_hc_irq(s, index);
        return;
        // printf("Ping send (pid %02x)\n",pid);
    } else if (s->is_ping) {
        // printf("ping clear\n");
        s->is_ping = false;
    }

    trace_usb_stm_handle_packet(chan, dev, &p->packet,
            hcchar->EPNUM,
            types[hcchar->EPTYP],
            dirs[hcchar->EPDIR],
            hcchar->MPSIZ,
            hctsiz->XFRSIZ,
            hctsiz->PKTCNT);

	if (hcchar->MPSIZ == 0) {
        qemu_log_mask(LOG_GUEST_ERROR,
                "%s: Bad HCCHAR_MPS set to zero\n", __func__);
        return;
    }

    if(hctsiz->PKTCNT==0)
    {
        //printf("pcnt=0, returning.\n"); // TODO - figure out why this happens and the halt reenables the channel.
        r_chan->HCCHAR.CHENA = false;
        return;
    }

    if (hcchar->EPTYP == USB_ENDPOINT_XFER_CONTROL && hctsiz->DPID == TSIZ_SC_MC_PID_SETUP) {
        pid = USB_TOKEN_SETUP;
    } else {
        pid = hcchar->EPDIR ? USB_TOKEN_IN : USB_TOKEN_OUT;
    }

    if (send) {
        tlen = hctsiz->XFRSIZ;
        if (p->small) {
            if (tlen > hcchar->MPSIZ) {
                tlen = hcchar->MPSIZ;
            }
        }

        if (pid != USB_TOKEN_IN) {
            trace_usb_stm_memory_read(s->fifo_head[chan], tlen);
            uint32_t words_required = (tlen>>2) + ((tlen%4>0));
			if (s->gahbcfg & GAHBCFG_DMA_EN)
			{
				// Note - USB DMA doesn't use the normal peripheral DMA engine.
				if (MEMTX_OK != dma_memory_read(&s->cpu_as, r_chan->HCDMA, s->usb_buf[chan], tlen, MEMTXATTRS_UNSPECIFIED))
				{
					qemu_log_mask(LOG_GUEST_ERROR, "%s: DMA memory read failed - transfer aborted.", __func__);
					return;
				}
			}
            else if (s->fifo_level[chan]<words_required)
            {
                //printf("No data to send in FIFO, ignoring...\n");
                return; // No data to send yet...
            }
			else // Fifo has enough data
			{
				uint32_t copy_end = s->fifo_head[chan] + words_required;
				if (copy_end > STM32F4xx_EP_FIFO_SIZE){
					// Split copy because we're looping back around.
					size_t bytes_to_end = ((STM32F4xx_EP_FIFO_SIZE - s->fifo_head[chan])) * sizeof(uint32_t);
					memcpy(s->usb_buf[chan],&s->tx_fifos[chan][s->fifo_head[chan]],bytes_to_end); // Copy from head to end of ringbuffer
					s->fifo_head[chan] = 0;
					memcpy(&s->usb_buf[chan][bytes_to_end],&s->tx_fifos[chan][0],tlen-bytes_to_end); // Copy remainder.
					s->fifo_head[chan] = copy_end %(STM32F4xx_EP_FIFO_SIZE);
				} else {
					memcpy(s->usb_buf[chan],&s->tx_fifos[chan][s->fifo_head[chan]],tlen);
					s->fifo_head[chan] += words_required;
				}
				s->fifo_level[chan] -= words_required;
			}
            // printf("USB TX:");
            // for (int i=0; i<tlen; i++)
            //     printf("%02x ",s->usb_buf[chan][i]);
            // printf("\n");
        }

        usb_packet_init(&p->packet);
        usb_packet_setup(&p->packet, pid, ep, 0, s->fifo_head[chan],
                         pid != USB_TOKEN_IN, true);
        usb_packet_addbuf(&p->packet, s->usb_buf[chan], hctsiz->XFRSIZ);
        p->async = STM32F4xx_ASYNC_NONE;
       	usb_handle_packet(dev, &p->packet);
    } else {
        tlen = p->len;
    }

    stsidx = -p->packet.status;
    assert(stsidx < sizeof(pstatus) / sizeof(*pstatus));
    actual = p->packet.actual_length;
    trace_usb_stm_packet_status(pstatus[stsidx], actual);

