vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
babble:
    if (p->packet.status != USB_RET_SUCCESS &&
            p->packet.status != USB_RET_NAK &&
            p->packet.status != USB_RET_STALL &&
            p->packet.status != USB_RET_ASYNC) {
        trace_usb_stm_packet_error(pstatus[stsidx]);
    }

    if (p->packet.status == USB_RET_ASYNC) {
        trace_usb_stm_async_packet(&p->packet, chan, dev, hcchar->EPNUM,
                                    dirs[hcchar->EPDIR], tlen);
        usb_device_flush_ep_queue(dev, ep);
        assert(p->async != STM32F4xx_ASYNC_INFLIGHT);
        p->devadr = devadr;
        p->epnum = hcchar->EPNUM;
        p->epdir = hcchar->EPDIR;
        p->mps = hcchar->MPSIZ;
        p->pid = pid;
        p->index = index;
        p->pcnt = hctsiz->PKTCNT;
        p->len = tlen;
        p->async = STM32F4xx_ASYNC_INFLIGHT;
        p->needs_service = false;
        return;
    }

    if (p->packet.status == USB_RET_SUCCESS) {
        if (actual > tlen*hctsiz->PKTCNT) {
            p->packet.status = USB_RET_BABBLE;
            goto babble;
        }

        if (pid == USB_TOKEN_IN) {
            // First constuct the packet header
            if (actual>0) {
                trace_usb_stm_memory_write(s->rx_fifo_tail, actual);
                REGDEF_NAME(usb, rxstatus) header = {.CHNUM = chan, .BCNT = actual, .DPID = hctsiz->DPID, .PKTSTS = 0b0010};
                // printf("packet in, size: %u\n",actual);
                // uint32_t orig_head =s->rx_fifo_tail;
                uint32_t words = (actual>>2); // +1 for header.
                if (actual%4 !=0) {
                    words++;
                }
                if (s->rx_fifo_level + words + 1 > STM32F4xx_RX_FIFO_SIZE)
                {
                    qemu_log_mask(LOG_GUEST_ERROR,"Receive FIFO full, data discarded!");
                }
				if (s->gahbcfg & GAHBCFG_DMA_EN)
				{
					if (MEMTX_OK != dma_memory_write(&s->cpu_as, r_chan->HCDMA, s->usb_buf[chan], actual, MEMTXATTRS_UNSPECIFIED))
					{
						qemu_log_mask(LOG_GUEST_ERROR, "%s: DMA memory write failed - transfer aborted.", __func__);
						return;
					}
				}
				else
				{
					s->rx_fifo_tail %= STM32F4xx_RX_FIFO_SIZE;
					s->fifo_ram[s->rx_fifo_tail++] = header.raw;
					s->rx_fifo_tail %= STM32F4xx_RX_FIFO_SIZE;
					s->rx_fifo_level++;
					uint32_t copy_end = s->rx_fifo_tail + words;
					if (copy_end > STM32F4xx_RX_FIFO_SIZE){
						size_t bytes_to_end = ((STM32F4xx_RX_FIFO_SIZE - s->rx_fifo_tail)) * sizeof(uint32_t);
						// Split copy because we're looping back around.
						memcpy(&s->fifo_ram[s->rx_fifo_tail],s->usb_buf[chan],bytes_to_end);
						s->rx_fifo_tail = 0; // Loop around.
						memcpy(&s->fifo_ram[s->rx_fifo_tail],&s->usb_buf[chan][bytes_to_end],actual - bytes_to_end);
						s->rx_fifo_tail = copy_end % (STM32F4xx_RX_FIFO_SIZE);
					} else {
						memcpy(&s->fifo_ram[s->rx_fifo_tail],s->usb_buf[chan],actual);
						s->rx_fifo_tail += words;
					}
					s->rx_fifo_level += words;
					assert(s->rx_fifo_tail <= 32768); // Fix this you lazy lump...
				}
                // printf("USB RX %u: ", actual);
                // for (int i=0; i<actual; i++)
                //     printf("%02x ",s->usb_buf[chan][i]);
                // printf("\n");
                // while (orig_head != s->rx_fifo_tail)
                // {
                //     printf("RxFifo add @ %u: %08x \n", orig_head, s->fifo_ram[orig_head]);
                //     orig_head++;
                // }
                s->GINTSTS.RXFLVL |= 1;
            }
            else
            {
                // printf("Incoming size 0, doping: %u\n",s->is_ping);
                hctsiz->PKTCNT--;
                // if (s->is_ping)
                // {
                //     intr |= HCINTMSK_ACK | HCINTMSK_XFERCOMPL;
                //     s->is_ping = 0;
                //     STM32F4xx_update_hc_irq(s, index);
                //     usb_packet_cleanup(&p->packet);
                //     return;
                // }
            }
        }

        tpcnt = actual / hcchar->MPSIZ;
        if (actual % hcchar->MPSIZ || tlen==0) {
            tpcnt++;
            if (pid == USB_TOKEN_IN) {
                done = true;
                // intr |= HCINTMSK_NYET; // Transfer complete.
            }
        }

        hctsiz->PKTCNT -= MIN(tpcnt, hctsiz->PKTCNT);
        hctsiz->XFRSIZ -= MIN(actual, hctsiz->XFRSIZ);
        // hcdma += actual;
        // s->hreg1[index + 5] = hcdma;

     if (hctsiz->PKTCNT == 0 || hctsiz->XFRSIZ == 0 || actual == 0) {
            done = true;
            // intr |= HCINTMSK_ACK;
        }
    } else {
        intr |= pintr[stsidx];
        if (p->packet.status == USB_RET_NAK &&
            (hcchar->EPTYP == USB_ENDPOINT_XFER_CONTROL ||
             hcchar->EPTYP == USB_ENDPOINT_XFER_BULK)) {
            /*
             * for ctrl/bulk, automatically retry on NAK,
             * but send the interrupt anyway
             */
            intr &= ~HCINTMSK_RESERVED14_31;
            s->hreg_chan[chan].HCINT.raw |= intr;
            do_intr = true;
        } else {
            intr |= HCINTMSK_CHHLTD;
            done = true;
        }
    }

    usb_packet_cleanup(&p->packet);

    if (done) {
        hcchar->CHENA = false;
        if (!(intr & HCINTMSK_CHHLTD)) {
            intr |= HCINTMSK_CHHLTD | HCINTMSK_XFERCOMPL;
        }
        intr &= ~HCINTMSK_RESERVED14_31;
        s->hreg_chan[chan].HCINT.raw |= intr;
        p->needs_service = false;
        trace_usb_stm_packet_done(pstatus[stsidx], actual, hctsiz->XFRSIZ, hctsiz->PKTCNT);
        STM32F4xx_update_hc_irq(s, index);
        return;
    }

    p->devadr = devadr;
    p->epnum = hcchar->EPNUM;
    p->epdir = hcchar->EPDIR;
    p->mps = hcchar->MPSIZ;
    p->pid = pid;
    p->index = index;
    p->pcnt = hctsiz->PKTCNT;
    p->len = hctsiz->XFRSIZ;
    p->needs_service = true;
    trace_usb_stm_packet_next(pstatus[stsidx], hctsiz->XFRSIZ, hctsiz->PKTCNT);
    if (do_intr) {
        STM32F4xx_update_hc_irq(s, index);
    }
}

/* Attach or detach a device on root hub */

static const char *speeds[] = {
    "low", "full", "high"
};

static void STM32F4xx_attach(USBPort *port)
{
    STM32F4xxUSBState *s = port->opaque;
    int hispd = 0;

