vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
    trace_usb_stm_attach(port);
    assert(port->index == 0);

    if (!port->dev || !port->dev->attached) {
        return;
    }

    assert(port->dev->speed <= USB_SPEED_HIGH);
    trace_usb_stm_attach_speed(speeds[port->dev->speed]);
    s->hprt0 &= ~HPRT0_SPD_MASK;

    switch (port->dev->speed) {
    case USB_SPEED_LOW:
        s->hprt0 |= HPRT0_SPD_LOW_SPEED << HPRT0_SPD_SHIFT;
        break;
    case USB_SPEED_FULL:
        s->hprt0 |= HPRT0_SPD_FULL_SPEED << HPRT0_SPD_SHIFT;
        break;
    case USB_SPEED_HIGH:
        s->hprt0 |= HPRT0_SPD_HIGH_SPEED << HPRT0_SPD_SHIFT;
        hispd = 1;
        break;
    }

    if (hispd) {
        s->usb_frame_time = NANOSECONDS_PER_SECOND / 8000;        /* 125000 */
        if (NANOSECONDS_PER_SECOND >= USB_HZ_HS) {
            s->usb_bit_time = NANOSECONDS_PER_SECOND / USB_HZ_HS; /* 10.4 */
        } else {
            s->usb_bit_time = 1;
        }
    } else {
        s->usb_frame_time = NANOSECONDS_PER_SECOND / 1000;        /* 1000000 */
        if (NANOSECONDS_PER_SECOND >= USB_HZ_FS) {
            s->usb_bit_time = NANOSECONDS_PER_SECOND / USB_HZ_FS; /* 83.3 */
        } else {
            s->usb_bit_time = 1;
        }
    }

    s->fi = USB_FRMINTVL - 1;
    s->HPRT.PCDET = 1;
    s->HPRT.PCSTS = 1;

    STM32F4xx_bus_start(s);
    STM32F4xx_raise_global_irq(s, GINTSTS_PRTINT);
}

static void STM32F4xx_detach(USBPort *port)
{
    STM32F4xxUSBState *s = port->opaque;

    trace_usb_stm_detach(port);
    assert(port->index == 0);

    STM32F4xx_bus_stop(s);
    s->HPRT.PSPD = 0;
    s->HPRT.PSUSP = 0;
    s->HPRT.PENA = 0;
    s->HPRT.PCSTS = 0;
    s->HPRT.PENCHNG = 1;
    s->HPRT.PCDET = 0;

    STM32F4xx_raise_global_irq(s, GINTSTS_PRTINT);
}

static void STM32F4xx_child_detach(USBPort *port, USBDevice *child)
{
    trace_usb_stm_child_detach(port, child);
    assert(port->index == 0);
}

static void STM32F4xx_wakeup(USBPort *port)
{
    STM32F4xxUSBState *s = port->opaque;

    trace_usb_stm_wakeup(port);
    assert(port->index == 0);

    if (s->HPRT.PSUSP) {
        s->HPRT.PRST = 1;
        STM32F4xx_raise_global_irq(s, GINTSTS_PRTINT);
    }

    qemu_bh_schedule(s->async_bh);
}

static void STM32F4xx_async_packet_complete(USBPort *port, USBPacket *packet)
{
    STM32F4xxUSBState *s = port->opaque;
    STM32F4xxPacket *p;
    USBDevice *dev;
    USBEndpoint *ep;

    assert(port->index == 0);
    p = container_of(packet, STM32F4xxPacket, packet);
    dev = STM32F4xx_find_device(s, p->devadr);
    ep = usb_ep_get(dev, p->pid, p->epnum);
    trace_usb_stm_async_packet_complete(port, packet, p->index >> 3, dev,
                                         p->epnum, dirs[p->epdir], p->len);
    assert(p->async == STM32F4xx_ASYNC_INFLIGHT);

    if (packet->status == USB_RET_REMOVE_FROM_QUEUE) {
        usb_cancel_packet(packet);
        usb_packet_cleanup(packet);
        return;
    }

    STM32F4xx_handle_packet(s, p->devadr, dev, ep, p->index, false);

    p->async = STM32F4xx_ASYNC_FINISHED;
    qemu_bh_schedule(s->async_bh);
}

static USBPortOps STM32F4xx_port_ops = {
    .attach = STM32F4xx_attach,
    .detach = STM32F4xx_detach,
    .child_detach = STM32F4xx_child_detach,
    .wakeup = STM32F4xx_wakeup,
    .complete = STM32F4xx_async_packet_complete,
};

static uint32_t STM32F4xx_get_frame_remaining(STM32F4xxUSBState *s)
{
    uint32_t fr = 0;
    int64_t tks;

    tks = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) - s->sof_time;
    if (tks < 0) {
        tks = 0;
    }

    /* avoid muldiv if possible */
    if (tks >= s->usb_frame_time) {
        goto out;
    }
    if (tks < s->usb_bit_time) {
        fr = s->fi;
        goto out;
    }

    /* tks = number of ns since SOF, divided by 83 (fs) or 10 (hs) */
    tks = tks / s->usb_bit_time;
    if (tks >= (int64_t)s->fi) {
        goto out;
    }

    /* remaining = frame interval minus tks */
    fr = (uint32_t)((int64_t)s->fi - tks);

out:
    return fr;
}

static void STM32F4xx_work_bh(void *opaque)
{
    STM32F4xxUSBState *s = opaque;
    STM32F4xxPacket *p;
    USBDevice *dev;
    USBEndpoint *ep;
    int64_t t_now, expire_time;
    int chan;
    bool found = false;

    trace_usb_stm_work_bh();
    if (s->working) {
        return;
    }
    s->working = true;

    t_now = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL);
    chan = s->next_chan;

    do {
        p = &s->packet[chan];
        if (p->needs_service) {
            dev = STM32F4xx_find_device(s, p->devadr);
            ep = usb_ep_get(dev, p->pid, p->epnum);
            trace_usb_stm_work_bh_service(s->next_chan, chan, dev, p->epnum);
            STM32F4xx_handle_packet(s, p->devadr, dev, ep, p->index, true);
            found = true;
        }
        if (++chan == STM32F4xx_NB_CHAN) {
            chan = 0;
        }
        if (found) {
            s->next_chan = chan;
            trace_usb_stm_work_bh_next(chan);
        }
    } while (chan != s->next_chan);

    if (found) {
        expire_time = t_now + NANOSECONDS_PER_SECOND / 4000;
        timer_mod(s->frame_timer, expire_time);
    }
    s->working = false;
}

static void STM32F4xx_enable_chan(STM32F4xxUSBState *s,  uint32_t index)
{
    USBDevice *dev;
    USBEndpoint *ep;
    REGDEF_NAME(usb,hcchar)* hcchar;
    REGDEF_NAME(usb,hctsiz)* hctsiz;
    STM32F4xxPacket *p;

    uint32_t chan = index>>3;
    assert(chan < STM32F4xx_NB_CHAN);
    hcchar = &s->hreg_chan[chan].HCCHAR;
    hctsiz = &s->hreg_chan[chan].HCTSIZ;
    p = &s->packet[chan];

    dev = STM32F4xx_find_device(s, hcchar->DAD);

    trace_usb_stm_enable_chan(chan, dev, &p->packet, hcchar->EPNUM);
    if (dev == NULL) {
        hcchar->CHENA = false; // Disable channel if device not found.
        return;
    }
    uint32_t pid;
    if (hcchar->EPTYP == USB_ENDPOINT_XFER_CONTROL && hctsiz->DPID == TSIZ_SC_MC_PID_SETUP) {
        pid = USB_TOKEN_SETUP;
    } else {
        pid = hcchar->EPDIR ? USB_TOKEN_IN : USB_TOKEN_OUT;
    }

    ep = usb_ep_get(dev, pid, hcchar->EPNUM);

    /*
     * Hack: Networking doesn't like us delivering large transfers, it kind
     * of works but the latency is horrible. So if the transfer is <= the mtu
     * size, we take that as a hint that this might be a network transfer,
     * and do the transfer packet-by-packet.
     */
    if (hctsiz->XFRSIZ > 1536) {
        p->small = false;
    } else {
        p->small = true;
    }

    STM32F4xx_handle_packet(s, hcchar->DAD, dev, ep, index, true);
    qemu_bh_schedule(s->async_bh);
}

