vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
// static const char *glbregnm[] = {
//     "GOTGCTL  ", "GOTGINT  ", "GAHBCFG  ", "GUSBCFG  ", "GRSTCTL  ",
//     "GINTSTS  ", "GINTMSK  ", "GRXSTSR  ", "GRXSTSP  ", "GRXFSIZ  ",
//     "GNPTXFSIZ", "GNPTXSTS ", "GI2CCTL  ", "GPVNDCTL ", "GGPIO    ",
//     "GUID     ", "GSNPSID  ", "GHWCFG1  ", "GHWCFG2  ", "GHWCFG3  ",
//     "GHWCFG4  ", "GLPMCFG  ", "GPWRDN   ", "GDFIFOCFG", "GADPCTL  ",
//     "GREFCLK  ", "GINTMSK2 ", "GINTSTS2 "
// };

static uint64_t STM32F4xx_glbreg_read(void *ptr, hwaddr addr, int index,
                                 unsigned size)
{
    STM32F4xxUSBState *s = ptr;
    uint32_t val;

    assert(addr <= GINTSTS2);
    val = s->glbreg[index];

    switch (addr) {
    case GRSTCTL:
        /* clear any self-clearing bits that were set */
        val &= ~(GRSTCTL_TXFFLSH | GRSTCTL_RXFFLSH | GRSTCTL_IN_TKNQ_FLSH |
                 GRSTCTL_FRMCNTRRST | GRSTCTL_HSFTRST | GRSTCTL_CSFTRST);
        s->glbreg[index] = val;
        break;
    case GRXSTSP:
        if (s->debug)
            printf("RX fifo pop (STSP): %08x @ %u\n", s->fifo_ram[s->rx_fifo_head], s->rx_fifo_head);
        if(s->rx_fifo_level>0) {
            val = s->fifo_ram[s->rx_fifo_head++];
			s->rx_fifo_head %= STM32F4xx_RX_FIFO_SIZE;
            s->rx_fifo_level--;
            if (s->rx_fifo_level == 0)
            {
                STM32F4xx_lower_global_irq(s,GINTSTS_RXFLVL);
            }
        } // else: val will be 0 from s->GRXSTSP;
        break;
    case GRXSTSR:
        // printf("rxfifo read\n");
        if (s->rx_fifo_level>0)
            val = s->fifo_ram[s->rx_fifo_head];
        break;
	// case R_GINTSTS:
	// 	// Update the endpoint interrupts.
	// 	s->GINTSTS.OEPINT = 0;
	// 	s->GINTSTS.IEPINT = 0;
	// 	for (int i=0; i<STM32F4xx_NB_DEVCHAN; i++)
	// 	{
	// 		s->GINTSTS.OEPINT |= s->drego[i].DOEPINT.raw & s->dreg0[R_DOEPMSK - R_DCFG];
	// 		s->GINTSTS.IEPINT |= s->dregi[i].DIEPINT.raw & s->dreg0[R_DIEPMSK - R_DCFG];
	// 	}
	// 	val = s->glbreg[index];
	// 	break;
    default:
        break;
    }

   // trace_usb_stm_glbreg_read(addr, glbregnm[index], val);
    return val;
}



static void STM32F4xx_tx_packet(STM32F4xxUSBState *s, int index)
{
    USBDevice *dev;
    USBEndpoint *ep;
    STM32F4xxPacket *p;

    assert((index >> 3) < STM32F4xx_NB_CHAN);
    p = &s->packet[index >> 3];

    REGDEF_NAME(usb,hcchar)* hcchar = &s->hreg_chan[index>>3].HCCHAR;
    REGDEF_NAME(usb,hctsiz)* hctsiz = &s->hreg_chan[index>>3].HCTSIZ;

    dev = STM32F4xx_find_device(s, hcchar->DAD);

    if (!s->is_device_mode && dev == NULL) {
        return;
    }

    uint32_t pid;
    if (hcchar->EPTYP == USB_ENDPOINT_XFER_CONTROL && hctsiz->DPID == TSIZ_SC_MC_PID_SETUP) {
        pid = USB_TOKEN_SETUP;
    } else {
        pid = hcchar->EPDIR ? USB_TOKEN_IN : USB_TOKEN_OUT;
    }

    ep = s->is_device_mode? NULL : usb_ep_get(dev, pid, hcchar->EPNUM);

    /*
     * Hack: Networking doesn't like us delivering large transfers, it kind
     * of works but the latency is horrible. So if the transfer is <= the mtu
     * size, we take that as a hint that this might be a network transfer,
     * and do the transfer packet-by-packet.
     */
    if (hctsiz->XFRSIZ > 1536) {
        p->small = false;
    } else {
        p->small = true;
    }

    STM32F4xx_handle_packet(s, hcchar->DAD, dev, ep, index, true);
    if (!s->is_device_mode) qemu_bh_schedule(s->async_bh);
}


static void STM32F4xx_flush_tx(void *ptr)
{
    STM32F4xxUSBState *s = ptr;
    uint16_t index = (s->grstctl & GRSTCTL_TXFNUM_MASK) >> GRSTCTL_TXFNUM_SHIFT;

    if (index==0b1000 || index>0)
    {
        printf("FIXME: >0 flush\n");
        return;
    }
    if (s->fifo_level[index] == 0) {
        return; // FIFO already empty.
    }
    // switch (index) {
    //     case 0b10000: // All
    //     break;
    //     default:

    // }

    printf("FIXME: PACKET FLUSH\n");
    //STM32F4xx_tx_packet(s);

}

static void STM32F4xx_glbreg_write(void *ptr, hwaddr addr, int index, uint64_t val,
                              unsigned size)
{
    STM32F4xxUSBState *s = ptr;
   // uint64_t orig = val;
    uint32_t *mmio;
    uint32_t old;
    int iflg = 0;

    assert(addr <= GINTSTS2);
    mmio = &s->glbreg[index];
    old = *mmio;

    switch (addr) {
    case GOTGCTL:
        /* don't allow setting of read-only bits */
        val &= ~(GOTGCTL_MULT_VALID_BC_MASK | GOTGCTL_BSESVLD |
                 GOTGCTL_ASESVLD | GOTGCTL_DBNC_SHORT | GOTGCTL_CONID_B |
                 GOTGCTL_HSTNEGSCS | GOTGCTL_SESREQSCS);
        /* don't allow clearing of read-only bits */
        val |= old & (GOTGCTL_MULT_VALID_BC_MASK | GOTGCTL_BSESVLD |
                      GOTGCTL_ASESVLD | GOTGCTL_DBNC_SHORT | GOTGCTL_CONID_B |
                      GOTGCTL_HSTNEGSCS | GOTGCTL_SESREQSCS);
        break;
    case GAHBCFG:
        if ((val & GAHBCFG_GLBL_INTR_EN) && !(old & GAHBCFG_GLBL_INTR_EN)) {
            iflg = 1;
        }
        if (val & GAHBCFG_NP_TXF_EMP_LVL)
            printf("FIXME: TXFE flag w/ half-empty config\n");
        break;
    case GUSBCFG:
        if (val & GUSBCFG_FORCEDEVMODE) {
            printf("USB OTG: Changing to device mode\n");
			s->is_device_mode = true;
            s->GINTSTS.CMOD = 0;
			s->dreg_defs.DSTS.ENUMSPD = (s->parent_obj.periph == STM32_P_USBHS ? DSTS_SPEED_HS : DSTS_SPEED_FS);
        }
        break;
    case GRSTCTL:
        val |= GRSTCTL_AHBIDLE;
        val &= ~GRSTCTL_DMAREQ;
        if (!(old & GRSTCTL_TXFFLSH) && (val & GRSTCTL_TXFFLSH)) {
                /* TODO - TX fifo flush */
            STM32F4xx_flush_tx(s);
        }
        if (!(old & GRSTCTL_RXFFLSH) && (val & GRSTCTL_RXFFLSH)) {
                /* TODO - RX fifo flush */
            qemu_log_mask(LOG_UNIMP, "Rx FIFO flush not implemented\n");
        }
        if (!(old & GRSTCTL_IN_TKNQ_FLSH) && (val & GRSTCTL_IN_TKNQ_FLSH)) {
                /* TODO - device IN token queue flush */
            qemu_log_mask(LOG_UNIMP, "Token queue flush not implemented\n");
        }
        if (!(old & GRSTCTL_FRMCNTRRST) && (val & GRSTCTL_FRMCNTRRST)) {
                /* TODO - host frame counter reset */
            qemu_log_mask(LOG_UNIMP, "Frame counter reset not implemented\n");
        }
        if (!(old & GRSTCTL_HSFTRST) && (val & GRSTCTL_HSFTRST)) {
                /* TODO - host soft reset */
            qemu_log_mask(LOG_UNIMP, "Host soft reset not implemented\n");
        }
        if (!(old & GRSTCTL_CSFTRST) && (val & GRSTCTL_CSFTRST)) {
                /* TODO - core soft reset */
            qemu_log_mask(LOG_UNIMP, "Core soft reset not implemented\n");
        }
        /* don't allow clearing of self-clearing bits */
        val |= old & (GRSTCTL_TXFFLSH | GRSTCTL_RXFFLSH |
                      GRSTCTL_IN_TKNQ_FLSH | GRSTCTL_FRMCNTRRST |
                      GRSTCTL_HSFTRST | GRSTCTL_CSFTRST);
        break;
    case R_GINTSTS*4:
        /* clear the write-1-to-clear bits */
        val |= ~old;
        val = ~val;
        /* don't allow clearing of read-only bits */
        val |= old & (GINTSTS_PTXFEMP | GINTSTS_HCHINT | GINTSTS_PRTINT |
                      GINTSTS_OEPINT | GINTSTS_IEPINT | GINTSTS_GOUTNAKEFF |
                      GINTSTS_GINNAKEFF | GINTSTS_NPTXFEMP | GINTSTS_RXFLVL |
                      GINTSTS_OTGINT | GINTSTS_CURMODE_HOST);
        iflg = 1;
        if ((s->GINTSTS.USBRST && ((~val)&GINTSTS_USBRST)) && s->device_state==DEV_ST_RESET_WAIT) {
            s->device_state = DEV_ST_SETUP;
            STM32F4xx_cdc_schedule(s);
        }
        break;
    case GINTMSK:
        iflg = 1;
        break;
    case GRXSTSP:
    case GRXSTSR:
        printf("write to sts/siz\n");
        /* FALLTHRU */
    case GRXFSIZ:
        break;
    default:
        break;
    }

    //trace_usb_stm_glbreg_write(addr, glbregnm[index], orig, old, val);
    *mmio = val;

