vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
    if (iflg) {
        STM32F4xx_update_hc_irq(s, index & ~7);
    }
}

static void STM32F4xx_dreg0_write(void *ptr, hwaddr addr, int index, uint64_t val,
                             unsigned size)
{
    STM32F4xxUSBState *s = ptr;
    //uint64_t orig = val;
    //uint32_t *mmio;
    uint32_t old;

    old = s->dreg0[index];

    uint32_t changed = old^val;

    addr>>=2;

    assert(addr >= R_DCFG && addr <= R_DIEPEMPMSK);
    switch (addr){
        case R_DCTL:
            s->dreg0[index] = val;
            if (changed&DCTL_SFTDISCON) {
                //DC connected, start setup.
                if (s->dreg_defs.DCTL.SDIS) {
                    s->device_state = 0;//DEV_ST_RESET;
                } else {
                    // if (!qemu_chr_fe_backend_connected(&s->cdc))
					// {
					// 	s->usbip_cfg.self = USBIP_SERVER(s); #endif
                    // }
                    f4xx_usb_cdc_setup(s);
                }
            }
        break;
        case R_DOEPMSK:
        case R_DIEPMSK:
        case R_DAINTMSK:
            s->dreg0[index] = val;
            STM32F4xx_update_device_common_irq(s);
            break;
        case R_DIEPEMPMSK:
            printf("EPEMPMSK Write: %08x -> %"PRIx64" to addr %"HWADDR_PRIx"\n",s->dreg0[index] , val, addr<<2);
            s->dreg0[index] = val;
            //uint8_t mask = val & 0xFU;
            // if ((s->device_state > DEV_ST_SETCTLLINE_WAIT) && mask)
            // {
            //     for (int i=0; i<STM32F4xx_NB_DEVCHAN; i++)
            //     {
            //         if (mask & (1U << i)) {
            //             STM32F4xx_raise_device_ep_in_irq(s, i, DIEPMSK_TXFIFOEMPTY);
            //         } else {
            //             STM32F4xx_lower_device_ep_in_irq(s, i, DIEPMSK_TXFIFOEMPTY);
            //         }
            //     }
            // }
            // else if (s->device_state >= DEV_ST_IO_READY && s->fifo_level[1] == 0)
            // {
            //     s->dreg_defs.DAINT.IEPINT &= (~2U);
            //     STM32F4xx_lower_global_irq(s, GINTSTS_IEPINT);
            // }
            // else
            // {
                STM32F4xx_update_device_common_irq(s);
            // }
            break;
        case R_DAINT:
            qemu_log_mask(LOG_GUEST_ERROR,"Attempted to write read-only USB DAINT register!");
            break;
        default:
            printf("unhandled USBD Write: %"PRIx64" to addr %"HWADDR_PRIx"\n", val, addr<<2);
            break;
    }

}

static uint64_t STM32F4xx_dreg0_read(void *ptr, hwaddr addr, int index,
                                unsigned size)
{
    STM32F4xxUSBState *s = ptr;
    uint32_t val;
    addr >>=2;
    assert(addr >= R_DCFG && addr <= R_DIEPEMPMSK);
	switch (addr)
	{
		case RI_DAINT:
			val = f4xx_usb_get_daint(s);
			break;
		default:
    		val = s->dreg0[index];
	}
    //printf("DREG0 read: %"HWADDR_PRIx ": %"PRIx32" \n", addr<<2, val );
    return val;
}

static uint64_t STM32F4xx_dregout_read(void *ptr, hwaddr addr, int index,
                                unsigned size)
{
    STM32F4xxUSBState *s = ptr;
    uint32_t chan = index>>3;
    uint32_t offset = index & 0b111;
    uint32_t val;
    assert(chan<=4);
    assert(offset <=0x20);

    val = s->drego[chan].raw[offset];

    if(s->debug && offset == RO_DOEPINT) printf("DREGout int read: %"HWADDR_PRIx ": %"PRIx32" \n", addr<<2, val );


   // printf("DREGOUT read: %"HWADDR_PRIx ": %"PRIx32" \n", addr, val );
    return val;
}

static void STM32F4xx_dregout_write(void *ptr, hwaddr addr, int index,
                                 uint64_t val, unsigned size)
{
    STM32F4xxUSBState *s = ptr;
    uint32_t chan = index>>3;
    uint32_t offset = index & 0b111;
    assert(chan<=4);
    assert(offset <=0x20);
    //printf("DREGOUT write: %"HWADDR_PRIx ": %"PRIx64" \n", addr, val );
    switch (offset) {
        case RO_DOEPCTL: // DIEPCTL
            s->drego[chan].raw[offset] = val;
            s->drego[chan].DOEPCTL.SNAK = 0;
            s->drego[chan].DOEPCTL.CNAK = 0;
            if (s->drego[chan].DOEPCTL.EPENA && s->device_state == DEV_ST_LINECODING_WAIT){
            //     s->device_state++;
                STM32F4xx_cdc_schedule(s);
            }
            break;
        case RO_DOEPINT: // DOEPINT
            // printf("DREGout int write %"PRIX64"\n",val);
            s->drego[chan].raw[offset] &= ~val;
            STM32F4xx_update_device_common_irq(s);
            break;
        default:
            s->drego[chan].raw[offset]= val;
            break;
    }
}


static uint64_t STM32F4xx_dregin_read(void *ptr, hwaddr addr, int index,
                                unsigned size)
{
    STM32F4xxUSBState *s = ptr;
    uint32_t chan = index>>3;
    uint32_t offset = index & 0b111;
    uint32_t val;
    assert(chan<=4);
    assert(offset <=0x20);


    switch (offset) {
        case RO_DTXFSTS:
            val = STM32F4xx_EP_FIFO_SIZE - s->fifo_level[chan];
            break;
        case RO_DIEPINT:
            s->dregi[chan].DIEPINT.TXFE = s->fifo_level[chan] == 0;
            printf("DEPINT read %d: %"PRIx32"\n",chan, s->dregi[chan].raw[offset]);
            /* FALLTHRU */
        default:
            val = s->dregi[chan].raw[offset];
    }

    //printf("DREGIN read: %"HWADDR_PRIx ": %"PRIx32" \n", addr, val );
    return val;
}

static void STM32F4xx_dregin_write(void *ptr, hwaddr addr, int index,
                                 uint64_t val, unsigned size)
{
    STM32F4xxUSBState *s = ptr;
    uint32_t chan = index>>3;
    uint32_t offset = index & 0b111;
    assert(chan<=4);
    assert(offset <=0x20);
    //printf("DREGIN write: %"HWADDR_PRIx ": %"PRIx64" \n", addr, val );
    switch (offset) {
        case RO_DIEPCTL: // DIEPCTL
            s->dregi[chan].raw[offset] = val;
            s->dregi[chan].DIEPCTL.SNAK = 0;
            s->dregi[chan].DIEPCTL.CNAK = 0;
            if (s->dregi[chan].DIEPCTL.EPENA)
                STM32F4xx_cdc_schedule(s);
            break;
        case RO_DIEPINT: // DIEPINT
            s->dregi[chan].raw[offset] &= ~val;
            STM32F4xx_update_device_common_irq(s);
            // if ((val & 1U) && s->device_state >= DEV_ST_IO_READY && s->fifo_level[1] == 0)
            // {
            // //   printf("Resetting xfcrcmplin\n");
            //     s->dreg_defs.DAINT.IEP &= (~2U);
            //     STM32F4xx_lower_global_irq(s, GINTSTS_IEPINT);
            // }
            break;
        default:
            s->dregi[chan].raw[offset]= val;
            break;
    }

