vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
}

static const char *pcgregnm[] = {
        "PCGCTL   ", "PCGCCTL1 "
};

static uint64_t STM32F4xx_pcgreg_read(void *ptr, hwaddr addr, int index,
                                 unsigned size)
{
    STM32F4xxUSBState *s = ptr;
    uint32_t val;

    assert(addr>>2 >= R_PCGCTL && addr>>2 <= R_PCGCCTL1);
    val = s->pcgreg[index];

    trace_usb_stm_pcgreg_read(addr, pcgregnm[index], val);
    return val;
}

static void STM32F4xx_pcgreg_write(void *ptr, hwaddr addr, int index,
                              uint64_t val, unsigned size)
{
    STM32F4xxUSBState *s = ptr;
    uint64_t orig = val;
    uint32_t *mmio;
    uint32_t old;

    assert(addr>>2 >= R_PCGCTL && addr>>2 <= R_PCGCCTL1);
    mmio = &s->pcgreg[index];
    old = *mmio;

    trace_usb_stm_pcgreg_write(addr, pcgregnm[index], orig, old, val);
    *mmio = val;
}

static uint64_t STM32F4xx_hsotg_read(void *ptr, hwaddr addr, unsigned size)
{
    uint64_t val = 0;

    switch (addr) {
    case HSOTG_REG(0x000) ... HSOTG_REG(0x0fc):
        val = STM32F4xx_glbreg_read(ptr, addr, (addr - HSOTG_REG(0x000)) >> 2, size);
        break;
    case HSOTG_REG(0x100):
        val = STM32F4xx_fszreg_read(ptr, addr, (addr - HSOTG_REG(0x100)) >> 2, size);
        break;
    case HSOTG_REG(0x104) ... HSOTG_REG(0x3fc):
        /* Gadget-mode registers, just return 0 for now */
        val = 0;
        break;
    case HSOTG_REG(0x400) ... HSOTG_REG(0x4fc):
        val = STM32F4xx_hreg0_read(ptr, addr, (addr - HSOTG_REG(0x400)) >> 2, size);
        break;
    case HSOTG_REG(0x500) ... HSOTG_REG(0x7fc):
        val = STM32F4xx_hreg1_read(ptr, addr, (addr - HSOTG_REG(0x500)) >> 2, size);
        break;
    case HSOTG_REG(0x800) ... HSOTG_REG(0x834):
        return STM32F4xx_dreg0_read(ptr, addr, (addr - HSOTG_REG(0x800)) >> 2, size);
    case HSOTG_REG(0x900) ... HSOTG_REG(0x978):
        return STM32F4xx_dregin_read(ptr, addr, (addr - HSOTG_REG(0x900)) >> 2, size);
    case HSOTG_REG(0xB00) ... HSOTG_REG(0xB70):
        return STM32F4xx_dregout_read(ptr, addr, (addr - HSOTG_REG(0xB00)) >> 2, size);
    case HSOTG_REG(0x980) ... HSOTG_REG(0xAFC):
    case HSOTG_REG(0xB74) ... HSOTG_REG(0xDFC):
        /* Gadget-mode registers, just return 0 for now */
        printf("USBD READ: addr %"HWADDR_PRIx"\n", addr);
        val = 0;
        break;
    case HSOTG_REG(0xe00) ... HSOTG_REG(0xffc):
        val = STM32F4xx_pcgreg_read(ptr, addr, (addr - HSOTG_REG(0xe00)) >> 2, size);
        break;
    default:
        printf("ERR: Unhandled register address read in stm32f4xx_usb_hostg_read\n");
    }

    return val;
}

static void STM32F4xx_hsotg_write(void *ptr, hwaddr addr, uint64_t val,
                             unsigned size)
{
    switch (addr) {
    case HSOTG_REG(0x000) ... HSOTG_REG(0x0fc):
        STM32F4xx_glbreg_write(ptr, addr, (addr - HSOTG_REG(0x000)) >> 2, val, size);
        break;
    case HSOTG_REG(0x100):
        STM32F4xx_fszreg_write(ptr, addr, (addr - HSOTG_REG(0x100)) >> 2, val, size);
        break;
    case HSOTG_REG(0x104) ... HSOTG_REG(0x3fc):
        /* Gadget-mode registers, do nothing for now */
        break;
    case HSOTG_REG(0x400) ... HSOTG_REG(0x4fc):
        STM32F4xx_hreg0_write(ptr, addr, (addr - HSOTG_REG(0x400)) >> 2, val, size);
        break;
    case HSOTG_REG(0x500) ... HSOTG_REG(0x7fc):
        STM32F4xx_hreg1_write(ptr, addr, (addr - HSOTG_REG(0x500)) >> 2, val, size);
        break;
    case HSOTG_REG(0x800) ... HSOTG_REG(0x834):
        STM32F4xx_dreg0_write(ptr, addr, (addr - HSOTG_REG(0x800)) >> 2, val, size);
        break;
    case HSOTG_REG(0x900) ... HSOTG_REG(0x978):
        STM32F4xx_dregin_write(ptr, addr, (addr - HSOTG_REG(0x900)) >> 2,  val, size);
        break;
    case HSOTG_REG(0xB00) ... HSOTG_REG(0xB70):
        STM32F4xx_dregout_write(ptr, addr,  (addr - HSOTG_REG(0xB00)) >> 2, val, size);
        break;
    case HSOTG_REG(0x980) ... HSOTG_REG(0xAFC):
    case HSOTG_REG(0xB74) ... HSOTG_REG(0xdfc):
        printf("USBD Write: %"PRIx64" to addr %"HWADDR_PRIx"\n", val, addr);
        /* Gadget-mode registers, do nothing for now */
        break;
    case HSOTG_REG(0xe00) ... HSOTG_REG(0xffc):
        STM32F4xx_pcgreg_write(ptr, addr, (addr - HSOTG_REG(0xe00)) >> 2, val, size);
        break;
    default:
        g_assert_not_reached();
    }
}

static const MemoryRegionOps STM32F4xx_mmio_hsotg_ops = {
    .read = STM32F4xx_hsotg_read,
    .write = STM32F4xx_hsotg_write,
    .impl.min_access_size = 4,
    .impl.max_access_size = 4,
    .endianness = DEVICE_NATIVE_ENDIAN,
};

static uint64_t STM32F4xx_hreg2_read(void *ptr, hwaddr addr, unsigned size)
{
    /* TODO - implement FIFOs to support slave mode */
    STM32F4xxUSBState *s = ptr;
    uint32_t value = 0;
    if (s->rx_fifo_level > 0) {
        value = s->fifo_ram[s->rx_fifo_head++];
        s->rx_fifo_head %= STM32F4xx_RX_FIFO_SIZE;
        s->rx_fifo_level--;
        if (s->rx_fifo_level == 0) {
            s->GINTSTS.RXFLVL = 0;
            STM32F4xx_update_irq(s);
        }
        if (s->debug) printf("FIFO read: %08x (L: %u H: %u T: %u)\n",value, s->rx_fifo_level, s->rx_fifo_head, s->rx_fifo_tail);
    }
    // trace_usb_stm_hreg2_read(addr, addr >> 12, value);
    // qemu_log_mask(LOG_GUEST_ERROR, "FIFO read not implemented\n");
    // printf("FIXME: Read FIFO\n");

    return value;
}

static void STM32F4xx_hreg2_write(void *ptr, hwaddr addr, uint64_t val,
                             unsigned size)
{
    uint64_t orig = val;
    STM32F4xxUSBState *s = ptr;
    uint8_t index = addr >> 12;
    trace_usb_stm_hreg2_write(addr, addr >> 12, orig, s->fifo_tail[index], val);
    if (s->fifo_level[index]==s->gnptxfsiz_txfd) {
        qemu_log_mask(LOG_GUEST_ERROR, "Wrote to a full FIFO (data discarded)!\n");
    }
    s->tx_fifos[index][s->fifo_tail[index]++] = val;
    // %size ensures we automatically loop back around.
    s->fifo_tail[index] %= STM32F4xx_EP_FIFO_SIZE;
    s->fifo_level[index]++;
    // printf("TX fifo write EP %u val %08"PRIx64"\n",index,val);
    STM32F4xx_lower_device_ep_in_irq(s, index, DIEPMSK_TXFIFOEMPTY);
    assert(s->fifo_tail[index]<STM32F4xx_EP_FIFO_SIZE); // laziness ftw
    uint32_t bytes_needed;
    int packets_left;
    if (s->GINTSTS.CMOD) {
        packets_left = s->hreg_chan[index].HCTSIZ.PKTCNT;
        bytes_needed =  s->hreg_chan[index].HCTSIZ.XFRSIZ;
    } else {
        packets_left = s->dregi[index].DIEPTSIZ.PKTCNT;
        bytes_needed = s->dregi[index].DIEPTSIZ.XFRSIZ;
    }

    int words_needed = (bytes_needed >> 2);
    if (bytes_needed % 4 !=0)
    {
        words_needed++;
    }

