vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
    if ( (s->fifo_level[index]) >= words_needed && packets_left>0) {
        // Enough data written to do a transfer...
    //     //printf("Data ready for tx on %u\n", index);
    //     if (s->device_state == DEV_ST_RESET) {
    //         // NOT CDC hack
#if USBIP_ENABLED
			if (s->device_state >= DEV_ST_USBIP)
			{
	        	s->usbip_pending_tx_bytes[index] = bytes_needed;
			}
#endif
            STM32F4xx_tx_packet(s, index<<3);
    //     } else {
    //         STM32F4xx_cdc_schedule(s);
    //     }
    }
}

static const MemoryRegionOps STM32F4xx_mmio_hreg2_ops = {
    .read = STM32F4xx_hreg2_read,
    .write = STM32F4xx_hreg2_write,
    .impl.min_access_size = 4,
    .impl.max_access_size = 4,
    .endianness = DEVICE_NATIVE_ENDIAN,
};

static void STM32F4xx_wakeup_endpoint(USBBus *bus, USBEndpoint *ep,
                                 unsigned int stream)
{
    STM32F4xxUSBState *s = container_of(bus, STM32F4xxUSBState, bus);

    trace_usb_stm_wakeup_endpoint(ep, stream);

    /* TODO - do something here? */
    qemu_bh_schedule(s->async_bh);
}

static USBBusOps STM32F4xx_bus_ops = {
    .wakeup_endpoint = STM32F4xx_wakeup_endpoint,
};

static void STM32F4xx_work_timer(void *opaque)
{
    STM32F4xxUSBState *s = opaque;

    trace_usb_stm_work_timer();
    qemu_bh_schedule(s->async_bh);
}

static void STM32F4xx_reset_enter(Object *obj, ResetType type)
{
    STM32F4xxClass *c = STM32F4xx_USB_GET_CLASS(obj);
    STM32F4xxUSBState *s = STM32F4xx_USB(obj);
    int i;

    trace_usb_stm_reset_enter();

    if (c->parent_phases.enter) {
        c->parent_phases.enter(obj, type);
    }

    timer_del(s->frame_timer);
    qemu_bh_cancel(s->async_bh);

    if (s->uport.dev && s->uport.dev->attached) {
        usb_detach(&s->uport);
    }

    STM32F4xx_bus_stop(s);

    s->gotgctl = GOTGCTL_BSESVLD | GOTGCTL_ASESVLD | GOTGCTL_CONID_B;
    s->gotgint = 0;
    s->gahbcfg = 0;
    s->gusbcfg = 5 << GUSBCFG_USBTRDTIM_SHIFT;
    s->grstctl = GRSTCTL_AHBIDLE;
    s->GINTSTS.raw = 0;
    s->GINTSTS.NPTXFE = 1;
    s->GINTSTS.PTXFE = 1;
    s->GINTSTS.CIDSCHG = 1;
    s->GINTSTS.CMOD = 1;
    s->gintmsk = 0;
    s->grxstsr = 0;
    s->grxstsp = 0;
    s->grxfsiz = 1024;
    s->gnptxfsiz = 1024 << FIFOSIZE_DEPTH_SHIFT;
    s->gnptxsts = (4 << FIFOSIZE_DEPTH_SHIFT) | 1024;
    s->gi2cctl = GI2CCTL_I2CDATSE0 | GI2CCTL_ACK;
    s->gpvndctl = 0;
    s->ggpio = 0;
    s->guid = 0x00001100;
    s->gsnpsid = 0x4f54294a;
    s->ghwcfg1 = 0;
    s->ghwcfg2 = (8 << GHWCFG2_DEV_TOKEN_Q_DEPTH_SHIFT) |
                 (4 << GHWCFG2_HOST_PERIO_TX_Q_DEPTH_SHIFT) |
                 (4 << GHWCFG2_NONPERIO_TX_Q_DEPTH_SHIFT) |
                 GHWCFG2_DYNAMIC_FIFO |
                 GHWCFG2_PERIO_EP_SUPPORTED |
                 ((STM32F4xx_NB_CHAN - 1) << GHWCFG2_NUM_HOST_CHAN_SHIFT) |
                 (GHWCFG2_INT_DMA_ARCH << GHWCFG2_ARCHITECTURE_SHIFT) |
                 (GHWCFG2_OP_MODE_NO_SRP_CAPABLE_HOST << GHWCFG2_OP_MODE_SHIFT);
    s->ghwcfg3 = (4096 << GHWCFG3_DFIFO_DEPTH_SHIFT) |
                 (4 << GHWCFG3_PACKET_SIZE_CNTR_WIDTH_SHIFT) |
                 (4 << GHWCFG3_XFER_SIZE_CNTR_WIDTH_SHIFT);
    s->ghwcfg4 = 0;
    s->glpmcfg = 0;
    s->gpwrdn = GPWRDN_PWRDNRSTN;
    s->gdfifocfg = 0;
    s->gadpctl = 0;
    s->grefclk = 0;
    s->gintmsk2 = 0;
    s->gintsts2 = 0;

    s->hptxfsiz = 500 << FIFOSIZE_DEPTH_SHIFT;

    s->hcfg = 2 << HCFG_RESVALID_SHIFT;
    s->hfir = 60000;
    s->hfnum = 0x3fff;
    s->hptxsts = (16 << TXSTS_QSPCAVAIL_SHIFT) | 32768;
    s->haint = 0;
    s->haintmsk = 0;
    s->hprt0 = 0;

    memset(s->hreg1, 0, sizeof(s->hreg1));
    memset(s->pcgreg, 0, sizeof(s->pcgreg));

    s->sof_time = 0;
    s->frame_number = 0;
    s->fi = USB_FRMINTVL - 1;
    s->next_chan = 0;
    s->working = false;
    s->is_ping = false;

    for (i = 0; i < STM32F4xx_NB_CHAN; i++) {
        s->packet[i].needs_service = false;

    }
    memset(s->tx_fifos, 0, STM32F4xx_NB_CHAN * 4 *KiB);
    memset(s->fifo_ram, 0, sizeof(s->fifo_ram));
    memset(s->fifo_head, 0, sizeof(s->fifo_head));
    memset(s->fifo_level, 0, sizeof(s->fifo_level));
    memset(s->fifo_tail, 0, sizeof(s->fifo_tail));

    memset(s->dreg0, 0, sizeof(s->dreg0));
    memset(s->dregi[0].raw, 0, sizeof(s->dregi));
    memset(s->drego[0].raw, 0, sizeof(s->drego));
    // RX fifo storage is the 2nd half of the 128k... for now.
    s->rx_fifo_head = 0;
    s->rx_fifo_tail = 0;
    s->rx_fifo_level = 0;

    STM32F4xx_update_device_common_irq(s);

	s->is_device_mode = false;

    s->device_state = 0;//DEV_ST_RESET;


}

static void STM32F4xx_reset_hold(Object *obj, ResetType type)
{
    STM32F4xxClass *c = STM32F4xx_USB_GET_CLASS(obj);
    STM32F4xxUSBState *s = STM32F4xx_USB(obj);

    trace_usb_stm_reset_hold();

    if (c->parent_phases.hold) {
        c->parent_phases.hold(obj, type);
    }

    STM32F4xx_update_irq(s);
}

static void STM32F4xx_reset_exit(Object *obj, ResetType type)
{
    STM32F4xxClass *c = STM32F4xx_USB_GET_CLASS(obj);
    STM32F4xxUSBState *s = STM32F4xx_USB(obj);

    trace_usb_stm_reset_exit();

    if (c->parent_phases.exit) {
        c->parent_phases.exit(obj, type);
    }

    s->hprt0 = 0;
    s->HPRT.PPWR = 1;
    if (s->uport.dev && s->uport.dev->attached) {
        usb_attach(&s->uport);
        usb_device_reset(s->uport.dev);
    }
}

// static void stm32f4xx_usb_reset(DeviceState *ds) {
//     // printf("RCC USB reset signal: %d\n",level);
//     STM32F4xxUSBState *s = STM32F4xx_USB(ds);
// 	STM32F4xx_reset_enter(OBJECT(s),RESET_TYPE_COLD);
// 	STM32F4xx_reset_exit(OBJECT(s), RESET_TYPE_COLD);
// }

static void STM32F4xx_realize(DeviceState *dev, Error **errp)
{
    SysBusDevice *sbd = SYS_BUS_DEVICE(dev);
    STM32F4xxUSBState *s = STM32F4xx_USB(dev);

	if (s->cpu_mr == NULL)
	{
		printf("No CPU memory region specified for %s - using global system memory.\n", _PERIPHNAMES[s->parent_obj.periph]);
		s->cpu_mr = get_system_memory();
	}
	gchar* name = g_strdup_printf("STM32_%s", _PERIPHNAMES[s->parent_obj.periph]);
	address_space_init(&s->cpu_as, s->cpu_mr, name);
	g_free(name);

	//s->debug = s->parent_obj.periph == STM32_P_USB2;

    usb_bus_new(&s->bus, sizeof(s->bus), &STM32F4xx_bus_ops, dev);
    usb_register_port(&s->bus, &s->uport, s, 0, &STM32F4xx_port_ops,
                      USB_SPEED_MASK_LOW | USB_SPEED_MASK_FULL |
                      (s->usb_version == 2 ? USB_SPEED_MASK_HIGH : 0));
    s->uport.dev = 0;

    s->usb_frame_time = NANOSECONDS_PER_SECOND / 1000;          /* 1000000 */
    if (NANOSECONDS_PER_SECOND >= USB_HZ_FS) {
        s->usb_bit_time = NANOSECONDS_PER_SECOND / USB_HZ_FS;   /* 83.3 */
    } else {
        s->usb_bit_time = 1;
    }

    s->fi = USB_FRMINTVL - 1;
    s->eof_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, STM32F4xx_frame_boundary, s);
    s->frame_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, STM32F4xx_work_timer, s);
    s->cdc_timer = timer_new_us(QEMU_CLOCK_VIRTUAL, STM32F4xx_cdc_helper, s);
    s->async_bh = qemu_bh_new(STM32F4xx_work_bh, s);

    if (s->disable_sofi)
    {
        printf("USB SOF Int disabled.\n");
    }

    sysbus_init_irq(sbd, &s->irq);

    qemu_chr_fe_set_handlers(&s->cdc, f4xx_usb_cdc_can_receive, f4xx_usb_cdc_receive, NULL,
            NULL,s,NULL,true);
    qemu_chr_fe_set_echo(&s->cdc, true);
#if USBIP_ENABLED
	s->usbip_cfg.port = 3240;
#endif
}

static void STM32F4xx_init(Object *obj)
{
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);
    STM32F4xxUSBState *s = STM32F4xx_USB(obj);

    CHECK_ALIGN(sizeof(s->hreg1), sizeof(s->hreg_chan), "hreg_raw");
	CHECK_TYPEDEF_u32(REGDEF_NAME(usb, hreg),HCCHAR);
	CHECK_UNION(REGDEF_NAME(usb, hreg),raw[RO_HCCHAR],HCCHAR);
	CHECK_UNION(REGDEF_NAME(usb, hreg),raw[RO_HCINT],HCINT);
	CHECK_UNION(REGDEF_NAME(usb, hreg),raw[RO_HCDMA],HCDMA);
    CHECK_ALIGN(sizeof(REGDEF_NAME(usb, hreg)), sizeof(s->hreg_chan[0].raw), "RAW");
	CHECK_UNION(REGDEF_NAME(usb, dreg_di_set),raw[RO_DIEPCTL],DIEPCTL);
	CHECK_UNION(REGDEF_NAME(usb, dreg_di_set),raw[RO_DIEPTSIZ],DIEPTSIZ);
    CHECK_ALIGN(sizeof(REGDEF_NAME(usb, dreg_di_set)), sizeof(s->dregi[0].raw), "RAW");
    CHECK_ALIGN(sizeof(REGDEF_NAME(usb, dreg_do_set)), sizeof(s->drego[0].raw), "RAW");
    CHECK_REG_u32(s->GINTSTS);
    //CHECK_ALIGN(sizeof(s->dreg0), sizeof(s->dreg_defs), "Common Dev Regs");
    CHECK_REG_u32(s->dreg_defs.DCFG);
    CHECK_REG_u32(s->dreg_defs.DCTL);
    CHECK_REG_u32(s->dreg_defs.DAINT);

    CHECK_TYPEDEF_u32(REGDEF_NAME(usb, hreg),HCCHAR);
    CHECK_TYPEDEF_u32(REGDEF_NAME(usb, hreg),HCSPLT);
    CHECK_TYPEDEF_u32(REGDEF_NAME(usb, hreg),HCINT);
    CHECK_TYPEDEF_u32(REGDEF_NAME(usb, hreg),HCINTMSK);
    CHECK_TYPEDEF_u32(REGDEF_NAME(usb, hreg),HCTSIZ);
    CHECK_TYPEDEF_u32(REGDEF_NAME(usb, hreg),HCDMA);

