vintagepc/MINI404/hw/arm/prusa/stm32f407/stm32f4xx_usb.c
	STM32_MR_INIT(&s->container, obj, 52U * KiB);

    sysbus_init_mmio(sbd, &s->container);

	STM32_MR_IO_INIT(&s->hsotg, obj, &STM32F4xx_mmio_hsotg_ops, s, 4U * KiB);

    memory_region_add_subregion(&s->container, 0x0000, &s->hsotg);

    STM32_MR_IO_INIT(&s->fifos, obj, &STM32F4xx_mmio_hreg2_ops, s, 64U * KiB);

    memory_region_add_subregion(&s->container, 0x1000, &s->fifos);

    // memory_region_init_io(&s->dma_mr, obj, &STM32F4xx_mmio_hreg2_ops, s,
    //                       "STM32F4xx-dbg", 0x1FFFF);
    // memory_region_add_subregion(&s->container, 0x20000, &s->dma_mr);
    //memory_region_init_io(&s->dma_mr, obj, NULL, s, "f4xx-usb.dma", 0x1FFFF);

    // printf("Starting USB IP thread...\n");
    // pthread_create(&s->usbip_thread, NULL, usbip_run, NULL);


}

static const VMStateDescription vmstate_STM32F4xx_state_packet = {
    .name = "STM32F4xx/packet",
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32(devadr, STM32F4xxPacket),
        VMSTATE_UINT32(epnum, STM32F4xxPacket),
        VMSTATE_UINT32(epdir, STM32F4xxPacket),
        VMSTATE_UINT32(mps, STM32F4xxPacket),
        VMSTATE_UINT32(pid, STM32F4xxPacket),
        VMSTATE_UINT32(index, STM32F4xxPacket),
        VMSTATE_UINT32(pcnt, STM32F4xxPacket),
        VMSTATE_UINT32(len, STM32F4xxPacket),
        VMSTATE_INT32(async, STM32F4xxPacket),
        VMSTATE_BOOL(small, STM32F4xxPacket),
        VMSTATE_BOOL(needs_service, STM32F4xxPacket),
        VMSTATE_END_OF_LIST()
    },
};

const VMStateDescription vmstate_STM32F4xx_state = {
    .name = "STM32F4xx",
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (const VMStateField[]) {
        VMSTATE_UINT32_ARRAY(glbreg, STM32F4xxUSBState,
                             STM32F4xx_GLBREG_SIZE / sizeof(uint32_t)),
        VMSTATE_UINT32_ARRAY(fszreg, STM32F4xxUSBState,
                             STM32F4xx_FSZREG_SIZE / sizeof(uint32_t)),
        VMSTATE_UINT32_ARRAY(hreg0, STM32F4xxUSBState,
                             STM32F4xx_HREG0_SIZE / sizeof(uint32_t)),
        VMSTATE_UINT32_ARRAY(hreg1, STM32F4xxUSBState,
                             STM32F4xx_NB_CHAN*RSZ_HREG),
        VMSTATE_UINT32_ARRAY(pcgreg, STM32F4xxUSBState,
                             STM32F4xx_PCGREG_SIZE / sizeof(uint32_t)),

        VMSTATE_TIMER_PTR(eof_timer, STM32F4xxUSBState),
        VMSTATE_TIMER_PTR(frame_timer, STM32F4xxUSBState),
        VMSTATE_INT64(sof_time, STM32F4xxUSBState),
        VMSTATE_INT64(usb_frame_time, STM32F4xxUSBState),
        VMSTATE_INT64(usb_bit_time, STM32F4xxUSBState),
        VMSTATE_UINT32(usb_version, STM32F4xxUSBState),
        VMSTATE_UINT16(frame_number, STM32F4xxUSBState),
        VMSTATE_UINT16(fi, STM32F4xxUSBState),
        VMSTATE_UINT16(next_chan, STM32F4xxUSBState),
        VMSTATE_BOOL(working, STM32F4xxUSBState),

        VMSTATE_STRUCT_ARRAY(packet, STM32F4xxUSBState, STM32F4xx_NB_CHAN, 1,
                             vmstate_STM32F4xx_state_packet, STM32F4xxPacket),
        VMSTATE_UINT8_2DARRAY(usb_buf, STM32F4xxUSBState, STM32F4xx_NB_CHAN,
                              STM32F4xx_MAX_XFER_SIZE),
        VMSTATE_UINT32_ARRAY(fifo_ram,STM32F4xxUSBState, STM32F4xx_RX_FIFO_SIZE),
        VMSTATE_UINT32_2DARRAY(tx_fifos,STM32F4xxUSBState,STM32F4xx_NB_CHAN,STM32F4xx_EP_FIFO_SIZE),
        VMSTATE_UINT16_ARRAY(fifo_head,STM32F4xxUSBState, STM32F4xx_NB_CHAN),
        VMSTATE_UINT16_ARRAY(fifo_level,STM32F4xxUSBState, STM32F4xx_NB_CHAN),
        VMSTATE_UINT16_ARRAY(fifo_tail,STM32F4xxUSBState, STM32F4xx_NB_CHAN),
        VMSTATE_UINT32(rx_fifo_head,STM32F4xxUSBState),
        VMSTATE_UINT32(rx_fifo_tail,STM32F4xxUSBState),
        VMSTATE_UINT32(rx_fifo_level,STM32F4xxUSBState),
        VMSTATE_UINT8(is_ping, STM32F4xxUSBState),
        VMSTATE_END_OF_LIST()
    }
};

static const Property STM32F4xx_usb_properties[] = {
    DEFINE_PROP_UINT32("usb_version", STM32F4xxUSBState, usb_version, 2),
    DEFINE_PROP_CHR("chardev", STM32F4xxUSBState, cdc),
	DEFINE_PROP_LINK("system-memory", STM32F4xxUSBState, cpu_mr, TYPE_MEMORY_REGION, MemoryRegion*),
    DEFINE_PROP_BOOL("disable_sof_interrupt", STM32F4xxUSBState, disable_sofi, false),
    DEFINE_PROP_UINT32("cdc_baud", STM32F4xxUSBState, cdc_baud, 57600),
};

static void STM32F4xx_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    STM32F4xxClass *c = STM32F4xx_USB_CLASS(klass);
    ResettableClass *rc = RESETTABLE_CLASS(klass);

    dc->realize = STM32F4xx_realize;
	//device_class_set_legacy_reset(dc, stm32f4xx_usb_reset);
    dc->vmsd = &vmstate_STM32F4xx_state;
    set_bit(DEVICE_CATEGORY_USB, dc->categories);
    device_class_set_props(dc, STM32F4xx_usb_properties);
    resettable_class_set_parent_phases(rc, STM32F4xx_reset_enter, STM32F4xx_reset_hold,
                                       STM32F4xx_reset_exit, &c->parent_phases);

    //USBIPServerClass *sc = USBIP_SERVER_CLASS(dc);
    //sc->usbip_handle_packet = STM32F4xx_usbip_handle_packet;
}

static const TypeInfo STM32F4xx_usb_type_info = {
    .name          = TYPE_STM32F4xx_USB,
    .parent        = TYPE_STM32_PERIPHERAL,
    .instance_size = sizeof(STM32F4xxUSBState),
    .instance_init = STM32F4xx_init,
    .class_size    = sizeof(STM32F4xxClass),
    .class_init    = STM32F4xx_class_init,
    .interfaces = (InterfaceInfo[]) {
//        { TYPE_USBIP_SERVER },
        { }
    }
};

static void STM32F4xx_usb_register_types(void)
{
    type_register_static(&STM32F4xx_usb_type_info);
}

type_init(STM32F4xx_usb_register_types)
